{
    "version": "https://jsonfeed.org/version/1",
    "title": "Codehost, Inc.",
    "home_page_url": "https://www.codehost.com/",
    "feed_url": "https://www.codehost.com/feed.json",
    "description": "Codehost, Inc is an innovative software company that brings value added solutions to businesses and OEMs worldwide.\n",
    "author": {
        "name": "Codehost, Inc."
    },
    "icon": "https://www.codehost.com/apple-touch-icon.png",
    "favicon": "https://www.codehost.com/favicon.ico",
    "expired": false,
    "items": [
    
        {
            "id": "https://www.codehost.com/news/2005/02/codehost-partners-with-objectif-lune.html",
            "title": "Codehost Partners With Objectif Lune",
            
            "content_text": "Objectif Lune and Codehost Inc. Partner to Expand Printing Choices for Linux MarketplaceMontreal, Quebec and Culver City, CA - February 22, 2005 — Objectif Lune, a leader in solutions for the efficient design and high-volume printing of transactional forms and variable content documents, today announced a cooperative partnership with Codehost, Inc. to address the printing needs of the emerging Linux marketplace. Codehost is the leading provider of Linux and Unix printing solutions.Sophisticated Unix printing has been a cumbersome chore for years, and Linux printing has also been very complex without many options. With Linux coming to the mainstream, the need for sophisticated print support in these environments is greater than ever.Now the two companies are actively collaborating to allow Objectif Lune PlanetPress software and the BrightQ printing suite from Codehost to talk directly to each other using standard shipset features. As a result, Linux environments gain a higher level of built-in functionality and flexibility without requiring users to manage communications between the two applications or deploy special versions of the software. PlanetPress can be used to automatically generate variable content-based documents and transactional forms for output, so Linux users can easily and instantly select a document or a form template for printing, eliminating time and steps in document workflow, while increasing output versatility and consistency.“Our vision is to support the full network environment with integrated document solutions. Linux is an area that is relatively new to the printing industry, but it should not be penalized with limited printing options,” said Objectif Lune CEO, Didier Gombert. “Our collaboration will help bring variable printing to the Linux and Unix world and give users the opportunity to more easily leverage variable printing as a business communication strategy for both the transactional and promotional world.”“We are working together to maximize the benefits of our document solutions to best serve the ever-changing environments of our customers and the needs of our OEM partners,” said Sam Bizri, President &amp; CEO, Codehost, Inc. “The easier we make Linux to use and demo to customers, the quicker printer vendors will be able to capitalize on this growing opportunity.”Codehost’s BrightQ printing suite is considered the de-facto Unix and Linux printing standard for the multi-function copier segment. BrightQ has been adopted by leading printing manufacturers to better serve their Unix and Linux clients, and it has helped vendors increase unit sales and network connectivity, while dramatically reducing Unix and Linux support costs for printing. As a desktop or server solution, BrightQ Pro saves service and support staff hours of time, while giving the end-user complete access to their printer’s output options. The added value of PlanetPress automation for variable content documents and transactional forms will further increase productivity gains.The PlanetPress suite of products from Objectif Lune enables sophisticated, conditional printing of text and graphics in an open architectural environment without modifications to host software. PlanetPress allows customers to offload heavy print stream traffic from enterprise networks and seamlessly divert it to laser printers for faster workflow. Companies achieve greater productivity from their existing processes, while gaining the ability to easily and quickly produce their critical printed business documents. Customers can dispense with costly, pre-printed forms; create high visual quality documents, automate high-volume production; simultaneously deliver electronic formats or fax; and create optimized searchable archives.“As Linux operating systems continue to gain market share and momentum, we are working together to ensure an integrated, user-friendly printing solution,” said Mr. Bizri. “The strong compatibility and synergy between our two companies will allow us to maximize the benefit of our technological innovations to serve the evolving needs of our customers and OEM partners.”The two companies also share strong relationships with leaders in digital printing technology, further increasing the value of the partnership. “We will be working together in the future on bringing other important solutions to the market. This partnership will allow us to increase the pace of our innovative document technologies and boost our leadership in the industry,” concluded Mr. Gombert.For more information, visit www.objectiflune.com. For more information on Codehost’s Unix and Linux Printing products and services, please visit www.codehost.com.",
            "content_html": "<h2 id=\"objectif-lune-and-codehost-inc-partner-to-expand-printing-choices-for-linux-marketplace\">Objectif Lune and Codehost Inc. Partner to Expand Printing Choices for Linux Marketplace</h2><p><b>Montreal, Quebec and Culver City, CA - February 22, 2005</b> — Objectif Lune, a leader in solutions for the efficient design and high-volume printing of transactional forms and variable content documents, today announced a cooperative partnership with Codehost, Inc. to address the printing needs of the emerging Linux marketplace. Codehost is the leading provider of Linux and Unix printing solutions.</p><p>Sophisticated Unix printing has been a cumbersome chore for years, and Linux printing has also been very complex without many options. With Linux coming to the mainstream, the need for sophisticated print support in these environments is greater than ever.</p><p>Now the two companies are actively collaborating to allow Objectif Lune PlanetPress software and the BrightQ printing suite from Codehost to talk directly to each other using standard shipset features. As a result, Linux environments gain a higher level of built-in functionality and flexibility without requiring users to manage communications between the two applications or deploy special versions of the software. PlanetPress can be used to automatically generate variable content-based documents and transactional forms for output, so Linux users can easily and instantly select a document or a form template for printing, eliminating time and steps in document workflow, while increasing output versatility and consistency.</p><p>“Our vision is to support the full network environment with integrated document solutions. Linux is an area that is relatively new to the printing industry, but it should not be penalized with limited printing options,” said Objectif Lune CEO, Didier Gombert. “Our collaboration will help bring variable printing to the Linux and Unix world and give users the opportunity to more easily leverage variable printing as a business communication strategy for both the transactional and promotional world.”</p><p>“We are working together to maximize the benefits of our document solutions to best serve the ever-changing environments of our customers and the needs of our OEM partners,” said Sam Bizri, President &amp; CEO, Codehost, Inc. “The easier we make Linux to use and demo to customers, the quicker printer vendors will be able to capitalize on this growing opportunity.”</p><p>Codehost’s BrightQ printing suite is considered the de-facto Unix and Linux printing standard for the multi-function copier segment. BrightQ has been adopted by leading printing manufacturers to better serve their Unix and Linux clients, and it has helped vendors increase unit sales and network connectivity, while dramatically reducing Unix and Linux support costs for printing. As a desktop or server solution, BrightQ Pro saves service and support staff hours of time, while giving the end-user complete access to their printer’s output options. The added value of PlanetPress automation for variable content documents and transactional forms will further increase productivity gains.</p><p>The PlanetPress suite of products from Objectif Lune enables sophisticated, conditional printing of text and graphics in an open architectural environment without modifications to host software. PlanetPress allows customers to offload heavy print stream traffic from enterprise networks and seamlessly divert it to laser printers for faster workflow. Companies achieve greater productivity from their existing processes, while gaining the ability to easily and quickly produce their critical printed business documents. Customers can dispense with costly, pre-printed forms; create high visual quality documents, automate high-volume production; simultaneously deliver electronic formats or fax; and create optimized searchable archives.</p><p>“As Linux operating systems continue to gain market share and momentum, we are working together to ensure an integrated, user-friendly printing solution,” said Mr. Bizri. “The strong compatibility and synergy between our two companies will allow us to maximize the benefit of our technological innovations to serve the evolving needs of our customers and OEM partners.”</p><p>The two companies also share strong relationships with leaders in digital printing technology, further increasing the value of the partnership. “We will be working together in the future on bringing other important solutions to the market. This partnership will allow us to increase the pace of our innovative document technologies and boost our leadership in the industry,” concluded Mr. Gombert.</p><p>For more information, visit <a href=\"http://www.objectiflune.com/\">www.objectiflune.com</a>. For more information on Codehost’s Unix and Linux Printing products and services, please visit <a href=\"https://www.codehost.com\">www.codehost.com</a>.</p>",
            "url": "https://www.codehost.com/news/2005/02/codehost-partners-with-objectif-lune.html",
            
            
            
            
            
            "date_published": "2005-02-22T00:00:00-08:00",
            "date_modified": "2005-02-22T00:00:00-08:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2004/09/codehost-releases-brightq-pro-v2.0.html",
            "title": "Codehost Releases BrightQ Pro v2.0",
            
            "content_text": "BrightQ Pro v2.0 makes printing from Unix and Linux more powerful and seamless than everCULVER CITY, CA - September 21, 2004  — Codehost Inc., the leading provider of Linux and Unix printing solutions for the multi-function print (MFP) industry, today announced the availability of the BrightQ Pro v2.0. The latest version of BrightQ includes new and enhanced feature functionality, and increased Linux distribution support that combine to make this the most powerful Unix and Linux printing suite available.BrightQ Pro abstracts ands simplifies the processes required to configure and manage today’s Unix and Linux printing systems. OEM printer support personnel, system admins and end-users save time and resources with the ability to conduct a network scan for printers; access to BrightQ Pro’s printer installation wizard; the ability to monitor network device status; and the ability to establish printer classes to manage load balancing.“BrightQ Pro brings the most sophisticated aspects of printing, with an easy and intuitive package, to the Unix and Linux industry,” said Eric Levy, GM of Printing at Codehost, Inc. “BrightQ Pro is not simply a print driver, it is a complete Unix and Linux printing solution.”BrightQ Pro supports many flavors of Unix and distributions of Linux while working in conjunction with all commonly utilized print systems (i.e. Berkeley, System V, and CUPS). Newly supported distributions of Linux include Fedora, Xandros and the Sun Microsystems Java Desktop.This is the third major BrightQ release since the product first became available in April of 2003. Since that time, Codehost’s BrightQ has helped MFP partners tap into this growing market, increasing unit sales and network connectivity while dramatically reducing the Unix and Linux support costs associated with these powerful imaging devices.Canon USA, an industry leader in MFP segments, offers BrightQ for free for the Canon imageRUNNER and other Canon multifunction devices. The Canon version of BrightQ Pro is a tightly integrated solution offering functionality that is specific to Canon devices. BrightQ Pro v2.0 for Canon can be downloaded for free at www.codehost.com/canon.BrightQ Pro v2.0 will be available for additional OEMs in the near future.About Codehost Inc.Codehost is the leader in Linux and Unix software development for manufacturers of printers and multi-function devices. With industry leaders such as Canon USA, Ricoh, EFI, Samsung and Kyocera Mita adopting Codehost’s printing solution, BrightQ has become the “standard” for Unix and Linux printing according to sever multifunction copier industry trade publications.For more information on Codehost’s Unix and Linux Printing products and services, please visit www.codehost.com.",
            "content_html": "<h2 id=\"brightq-pro-v20-makes-printing-from-unix-and-linux-more-powerful-and-seamless-than-ever\">BrightQ Pro v2.0 makes printing from Unix and Linux more powerful and seamless than ever</h2><p><b>CULVER CITY, CA - September 21, 2004 </b> — Codehost Inc., the leading provider of Linux and Unix printing solutions for the multi-function print (MFP) industry, today announced the availability of the BrightQ Pro v2.0. The latest version of BrightQ includes new and enhanced feature functionality, and increased Linux distribution support that combine to make this the most powerful Unix and Linux printing suite available.</p><p>BrightQ Pro abstracts ands simplifies the processes required to configure and manage today’s Unix and Linux printing systems. OEM printer support personnel, system admins and end-users save time and resources with the ability to conduct a network scan for printers; access to BrightQ Pro’s printer installation wizard; the ability to monitor network device status; and the ability to establish printer classes to manage load balancing.</p><p>“BrightQ Pro brings the most sophisticated aspects of printing, with an easy and intuitive package, to the Unix and Linux industry,” said Eric Levy, GM of Printing at Codehost, Inc. “BrightQ Pro is not simply a print driver, it is a complete Unix and Linux printing solution.”</p><p>BrightQ Pro supports many flavors of Unix and distributions of Linux while working in conjunction with all commonly utilized print systems (i.e. Berkeley, System V, and CUPS). Newly supported distributions of Linux include Fedora, Xandros and the Sun Microsystems Java Desktop.</p><p>This is the third major BrightQ release since the product first became available in April of 2003. Since that time, Codehost’s BrightQ has helped MFP partners tap into this growing market, increasing unit sales and network connectivity while dramatically reducing the Unix and Linux support costs associated with these powerful imaging devices.</p><p>Canon USA, an industry leader in MFP segments, offers BrightQ for free for the Canon imageRUNNER and other Canon multifunction devices. The Canon version of BrightQ Pro is a tightly integrated solution offering functionality that is specific to Canon devices. BrightQ Pro v2.0 for Canon can be downloaded for free at <a href=\"https://www.codehost.com/canon/\">www.codehost.com/canon</a>.</p><p>BrightQ Pro v2.0 will be available for additional OEMs in the near future.</p><h3 id=\"about-codehost-inc\">About Codehost Inc.</h3><p>Codehost is the leader in Linux and Unix software development for manufacturers of printers and multi-function devices. With industry leaders such as Canon USA, Ricoh, EFI, Samsung and Kyocera Mita adopting Codehost’s printing solution, BrightQ has become the “standard” for Unix and Linux printing according to sever multifunction copier industry trade publications.</p><p>For more information on Codehost’s Unix and Linux Printing products and services, please visit <a href=\"https://www.codehost.com\">www.codehost.com</a>.</p>",
            "url": "https://www.codehost.com/news/2004/09/codehost-releases-brightq-pro-v2.0.html",
            
            
            
            
            
            "date_published": "2004-09-21T00:00:00-07:00",
            "date_modified": "2004-09-21T00:00:00-07:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2004/06/codehost-partners-with-mandrakesoft.html",
            "title": "Codehost Partners With Mandrakesoft",
            
            "content_text": "Codehost and Mandrakesoft Partner to Support Enterprise Printing on LinuxCULVER CITY, CA and PARIS, FRANCE - June 10, 2004 — Codehost Inc., the leading provider of Linux and Unix printing solutions, and Mandrakesoft, publisher of the popular Linux distribution Mandrakelinux announced a cooperative partnership today. Codehost’s advanced Linux and Unix printing solution, BrightQ, will be distributed with Mandrakelinux 10, Mandrakesoft’s newest desktop Linux release. As part of the relationship, Codehost will use Mandrakelinux for educational and training sessions offered to their customer and partners. Codehost recently rolled out a suite of Linux- and Unix-related training classes for its partners, which consists of manufacturers and dealers of multi-function printing devices.“Our relationship with Mandrakesoft allows us to give our partners, and their sales channel, easy access to great tools like Mandrakemove,” said Trent Carlyle, Codehost Marketing Director. “Our partners are becoming more solution savvy, but Linux is an area that is relatively new to the printing industry. The easier we make Linux for them to use and demo to customers, the quicker they will be able to capitalize on this growing market.”The high-volume printing segment, born from the copier industry, was traditionally a hardware-only business, but is now becoming more solution-oriented. With the emergence and adoption of sophisticated multi-function digital devices over the last ten years, an opportunity arose to become a full provider of software and hardware solutions.“As Linux operating systems, such as Mandrake, continue to gain market share and momentum within the minds of IT personnel, Canon ensures an integrated and user friendly printing solution,\" said Dennis Amorosano, director and general manager, Integrated Solutions Group, Canon U.S.A. “With BrightQ, Linux users can enjoy the feature rich functionality of our Canon imageRUNNER multi-function devices with an intuitive printing solution.\"Sophisticated Unix printing has been a cumbersome chore for years. With Linux coming to the mainstream, the need for sophisticated print support in these environments is greater than ever. “With the combined efforts of hardware manufacturers, software developers and the operating systems, I believe Linux will be a viable desktop alternative for the enterprise and for consumer use in the short term,” said Eric Levy, General Manager, Print Systems of Codehost, Inc.About Codehost Inc.Founded in 1999, Codehost has emerged as the leader in Linux and Unix software development for leading manufacturers of printers and multi-function devices. With an expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.Codehost’s BrightQ printing solution has been called the standard for Unix and Linux printing in the multifunction copier industry several major printing trade publications.About MandrakesoftMandrakesoft is the publisher of the popular Mandrakelinux operating system, one of the most full-featured and easy to use Linux systems available. The company offers its enterprise, government and educational customers a complete range of GNU/Linux and Open Source software and related services. Mandrakesoft products are available in more than 120 countries through dedicated channels and also from Mandrake Store.com, the company’s online store. Number 1 in several countries, Mandrakesoft has been awarded many times for quality and the technical innovation of its products. \"Born on the Internet\" in late 1998, Mandrakesoft has established headquarters in the U.S.A. and in France. Mandrakesoft is traded on Paris Euronext Marche Libre (Euroclear code: 4477.PA; Reuters code: MAKE.PA) and the US OTC market (stock symbol MDKFF).",
            "content_html": "<h2 id=\"codehost-and-mandrakesoft-partner-to-support-enterprise-printing-on-linux\">Codehost and Mandrakesoft Partner to Support Enterprise Printing on Linux</h2><p><b>CULVER CITY, CA and PARIS, FRANCE - June 10, 2004 — </b>Codehost Inc., the leading provider of Linux and Unix printing solutions, and Mandrakesoft, publisher of the popular Linux distribution Mandrakelinux announced a cooperative partnership today. Codehost’s advanced Linux and Unix printing solution, BrightQ, will be distributed with Mandrakelinux 10, Mandrakesoft’s newest desktop Linux release. <br /></p><p>As part of the relationship, Codehost will use Mandrakelinux for educational and training sessions offered to their customer and partners. Codehost recently rolled out a suite of Linux- and Unix-related training classes for its partners, which consists of manufacturers and dealers of multi-function printing devices.</p><p>“Our relationship with Mandrakesoft allows us to give our partners, and their sales channel, easy access to great tools like Mandrakemove,” said Trent Carlyle, Codehost Marketing Director. “Our partners are becoming more solution savvy, but Linux is an area that is relatively new to the printing industry. The easier we make Linux for them to use and demo to customers, the quicker they will be able to capitalize on this growing market.”<br /></p><p>The high-volume printing segment, born from the copier industry, was traditionally a hardware-only business, but is now becoming more solution-oriented. With the emergence and adoption of sophisticated multi-function digital devices over the last ten years, an opportunity arose to become a full provider of software and hardware solutions.<br /></p><p>“As Linux operating systems, such as Mandrake, continue to gain market share and momentum within the minds of IT personnel, Canon ensures an integrated and user friendly printing solution,\" said Dennis Amorosano, director and general manager, Integrated Solutions Group, Canon U.S.A. “With BrightQ, Linux users can enjoy the feature rich functionality of our Canon imageRUNNER multi-function devices with an intuitive printing solution.\"<br /></p><p>Sophisticated Unix printing has been a cumbersome chore for years. With Linux coming to the mainstream, the need for sophisticated print support in these environments is greater than ever. <br /></p><p>“With the combined efforts of hardware manufacturers, software developers and the operating systems, I believe Linux will be a viable desktop alternative for the enterprise and for consumer use in the short term,” said Eric Levy, General Manager, Print Systems of Codehost, Inc.<br /></p><h3 id=\"about-codehost-inc\">About Codehost Inc.</h3><p>Founded in 1999, Codehost has emerged as the leader in Linux and Unix software development for leading manufacturers of printers and multi-function devices. With an expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.<br /></p><p>Codehost’s BrightQ printing solution has been called the standard for Unix and Linux printing in the multifunction copier industry several major printing trade publications.<br /></p><h3 id=\"about-mandrakesoft\">About Mandrakesoft</h3><p>Mandrakesoft is the publisher of the popular Mandrakelinux operating system, one of the most full-featured and easy to use Linux systems available. The company offers its enterprise, government and educational customers a complete range of GNU/Linux and Open Source software and related services. Mandrakesoft products are available in more than 120 countries through dedicated channels and also from Mandrake Store.com, the company’s online store. Number 1 in several countries, Mandrakesoft has been awarded many times for quality and the technical innovation of its products. \"Born on the Internet\" in late 1998, Mandrakesoft has established headquarters in the U.S.A. and in France. Mandrakesoft is traded on Paris Euronext Marche Libre (Euroclear code: 4477.PA; Reuters code: MAKE.PA) and the US OTC market (stock symbol MDKFF).<br /></p>",
            "url": "https://www.codehost.com/news/2004/06/codehost-partners-with-mandrakesoft.html",
            
            
            
            
            
            "date_published": "2004-06-11T00:00:00-07:00",
            "date_modified": "2004-06-11T00:00:00-07:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2004/01/ricoh-introduces-brightq.html",
            "title": "Ricoh Introduces BrightQ",
            
            "content_text": "RICOH ADOPTS CODEHOST’S BRIGHTQ AS NEXT GENERATION SOLUTION FOR LINUX AND UNIX PRINTINGWest Caldwell, NJ and Culver City, California - January 22, 2004 — Ricoh Corporation, the leading provider of digital office equipment, today introduced the availability of BrightQ, a printing solution designed by Codehost Inc. to provide today’s IT system administrators and printer support personnel with an easy to use, graphically rich X Window System and UNIX Shell-Based printing environment.BrightQ was developed exclusively for the UNIX and Linux operating systems giving users the ability to access all available finishing features of the Ricoh Aficio and other supported Ricoh devices. Educational, government, banking and financial institutions, as well as the corporate data center will benefit as the adoption of Linux into these vertical market environments continues to grow.Printing on UNIX and Linux can often be challenging to configure and support due to the lack of unified printing systems and APIs. Codehost’s BrightQ package includes an easy to use X Window System and UNIX Shell-Based installation and configuration wizard that mitigates the challenge of installing and configuring Ricoh printers on UNIX and Linux systems. BrightQ supports a number of Ricoh output devices including the Aficio 1022/1027 PS, Aficio 1060/1075 PS, Aficio 1224/1232 PS, CL 3000 PS, and AP 3800C PS, among others.The key advantages BrightQ provides to the end user include finishing capabilities such as document duplexing, stapling, sorting and hole punching, and BrightQ supports commonly installed print utilities such as CUPS, LPR, LPD, SMB and IPP. Additionally, BrightQ provides a unified printing interface across all supported operating environments. Supported UNIX systems include Sun Solaris (x86 and ULTRASparc), Hewlett Packard’s HP-UX, Irix by Silicon Graphics, IBM’s AIX, SCO Open UNIX, SCO Open Server and FreeBSD. BrightQ also supports all major Linux distributions including Red Hat, SuSE and Mandrake.BrightQ is comprised of four core modules including BrightInstall, Codehost’s turnkey installer designed to simplify both installation and un-installation; Codehost’s License Manager, which allows users to upgrade BrightQ without replacing the application; a Configuration Tool, which abstracts the most complex print configuration options and a Print Job Manager, the dynamic UNIX and Linux printing user interface that is accessible from virtually all UNIX or Linux applications.“BrightQ exemplifies Ricoh’s goal of continually offering viable solutions that enhance our product line as well as improve our customer’s bottom-line,” said Hede Nonaka, Vice President of Marketing for Ricoh Corporation.BrightQ, along with a Ricoh Codehost Demo License, can be acquired via the Ricoh Codehost URL at www.codehost.com/ricoh.About Codehost Inc.Founded in 1999, Codehost has emerged as the leader in Linux and UNIX software development and services for leading manufacturers of printers, multi-function peripherals and imaging devices. With an expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.BrightQ, Codehost’s marquee printing application for UNIX and Linux, has become the standard solution for multi-function and workgroup printer manufacturers providing advanced print support for their customers’ complex operating environments.More information about Codehost product and services can be found at www.codehost.com.About Ricoh CorporationRicoh Corporation, headquartered in West Caldwell, N.J., is a subsidiary of Ricoh Company Ltd., the 67-year-old leading supplier of office automation equipment and electronics, with fiscal year 2002 sales in excess of $14.7 billion.Ricoh Corporation is a leading provider of digital office equipment, including color and black &amp; white digital imaging systems, facsimile products, printers, scanners, digital duplicators and wide format engineering systems.Ricoh Corporation directly or through its subsidiaries market and distribute products under the Ricoh, Savin, Gestetner and Lanier brands in North, Central and South America. For fiscal year 2002, Ricoh Corporation sales exceeded $2.8 billion.Information about Ricoh’s complete range of products and services can be accessed on the World Wide Web at www.ricoh-usa.com.",
            "content_html": "<h2 id=\"ricoh-adopts-codehosts-brightq-as-next-generation-solution-for-linux-and-unix-printing\">RICOH ADOPTS CODEHOST’S BRIGHTQ AS NEXT GENERATION SOLUTION FOR LINUX AND UNIX PRINTING</h2><p><b>West Caldwell, NJ and Culver City, California - January 22, 2004</b> — Ricoh Corporation, the leading provider of digital office equipment, today introduced the availability of BrightQ, a printing solution designed by Codehost Inc. to provide today’s IT system administrators and printer support personnel with an easy to use, graphically rich X Window System and UNIX Shell-Based printing environment.</p><p>BrightQ was developed exclusively for the UNIX and Linux operating systems giving users the ability to access all available finishing features of the Ricoh Aficio and other supported Ricoh devices. Educational, government, banking and financial institutions, as well as the corporate data center will benefit as the adoption of Linux into these vertical market environments continues to grow.</p><p>Printing on UNIX and Linux can often be challenging to configure and support due to the lack of unified printing systems and APIs. Codehost’s BrightQ package includes an easy to use X Window System and UNIX Shell-Based installation and configuration wizard that mitigates the challenge of installing and configuring Ricoh printers on UNIX and Linux systems. BrightQ supports a number of Ricoh output devices including the Aficio 1022/1027 PS, Aficio 1060/1075 PS, Aficio 1224/1232 PS, CL 3000 PS, and AP 3800C PS, among others.</p><p>The key advantages BrightQ provides to the end user include finishing capabilities such as document duplexing, stapling, sorting and hole punching, and BrightQ supports commonly installed print utilities such as CUPS, LPR, LPD, SMB and IPP. Additionally, BrightQ provides a unified printing interface across all supported operating environments. Supported UNIX systems include Sun Solaris (x86 and ULTRASparc), Hewlett Packard’s HP-UX, Irix by Silicon Graphics, IBM’s AIX, SCO Open UNIX, SCO Open Server and FreeBSD. BrightQ also supports all major Linux distributions including Red Hat, SuSE and Mandrake.</p><p>BrightQ is comprised of four core modules including BrightInstall, Codehost’s turnkey installer designed to simplify both installation and un-installation; Codehost’s License Manager, which allows users to upgrade BrightQ without replacing the application; a Configuration Tool, which abstracts the most complex print configuration options and a Print Job Manager, the dynamic UNIX and Linux printing user interface that is accessible from virtually all UNIX or Linux applications.</p><p>“BrightQ exemplifies Ricoh’s goal of continually offering viable solutions that enhance our product line as well as improve our customer’s bottom-line,” said Hede Nonaka, Vice President of Marketing for Ricoh Corporation.</p><p>BrightQ, along with a Ricoh Codehost Demo License, can be acquired via the Ricoh Codehost URL at <a href=\"https://www.codehost.com/ricoh/\">www.codehost.com/ricoh</a>.</p><h3 id=\"about-codehost-inc\">About Codehost Inc.</h3><p>Founded in 1999, Codehost has emerged as the leader in Linux and UNIX software development and services for leading manufacturers of printers, multi-function peripherals and imaging devices. With an expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.</p><p>BrightQ, Codehost’s marquee printing application for UNIX and Linux, has become the standard solution for multi-function and workgroup printer manufacturers providing advanced print support for their customers’ complex operating environments.</p><p>More information about Codehost product and services can be found at <a href=\"https://www.codehost.com\">www.codehost.com</a>.</p><h3 id=\"about-ricoh-corporation\">About Ricoh Corporation</h3><p>Ricoh Corporation, headquartered in West Caldwell, N.J., is a subsidiary of Ricoh Company Ltd., the 67-year-old leading supplier of office automation equipment and electronics, with fiscal year 2002 sales in excess of $14.7 billion.</p><p>Ricoh Corporation is a leading provider of digital office equipment, including color and black &amp; white digital imaging systems, facsimile products, printers, scanners, digital duplicators and wide format engineering systems.</p><p>Ricoh Corporation directly or through its subsidiaries market and distribute products under the Ricoh, Savin, Gestetner and Lanier brands in North, Central and South America. For fiscal year 2002, Ricoh Corporation sales exceeded $2.8 billion.</p><p>Information about Ricoh’s complete range of products and services can be accessed on the World Wide Web at <a href=\"http://www.ricoh-usa.com/\">www.ricoh-usa.com</a>.</p>",
            "url": "https://www.codehost.com/news/2004/01/ricoh-introduces-brightq.html",
            
            
            
            
            
            "date_published": "2004-01-22T00:00:00-08:00",
            "date_modified": "2004-01-22T00:00:00-08:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2004/01/efi-and-codehost-announce-partnership.html",
            "title": "EFI And Codehost Announce Partnership",
            
            "content_text": "New alliance delivers robust, intuitive BrightQ printing solution to Unix and Linux customersCulver City and Foster City, Calif. - January 15, 2004 — Codehost Inc., the printing industry’s leading provider of Unix and Linux solutions, and Electronics For Imaging (EFI), the world leader in digital imaging and print management solutions for commercial and enterprise printing, today announced a strategic partnership to make the Codehost BrightQ Unix and Linux printing suite available to manufacturers of printers and multifunction devices utilizing EFI’s industry renowned Fiery print servers.The addition of BrightQ to the EFI Fiery family of products will enable seamless integration of sophisticated data filters into the Unix and Linux printing workflow. These filters are designed to give easy access to a device’s complete feature set. EFI’s printer manufacturer partners can now increase the connectivity rate of their engines by gaining access to these additional markets.“We are excited to partner with Codehost to bring the advantages of our robust Fiery server technology to Unix and Linux customers,” said James Lopez, Director of Product Marketing, EFI. “Users in legacy environments can now take full advantage of the functionality of their high-end color and Black &amp; White printers while increasing their productivity and enhancing their digital printing experience with all advanced software tools EFI’s Fiery print servers have to offer.”BrightQ is a cohesive turnkey printing package that was developed to provide Unix and Linux operating systems with an intuitive yet feature-rich printing solution. BrightQ ensures that print data is filtered appropriately to capitalize upon all of the OEM output device functionality. BrightQ dramatically improves the printing experience for Unix and Linux users and simplifies the administrative tasks of installation and configuration of multiple printers and print queues on workstations and servers across the enterprise. BrightQ supports all popular distributions of Linux and multiple versions of Unix including Sun’s Solaris, Hewlett Packard’s HP-UX, AIX from IBM, FreeBSD, Irix, and the SCO operating systems. This powerful product is designed for compatibility and operates seamlessly with common Linux and Unix print spoolers, such as CUPS, BSD, and System V. BrightQ’s components can be accessed via an intuitive X Window System graphical interface, or via Linux and Unix shell based interfaces.“The inclusion of BrightQ with the supported line of EFI print controllers will enable EFI’s partners to gain access to the rapidly growing Linux enterprise market, while at the same time capitalizing on the existing legacy Unix installations in the data center and elsewhere in the enterprise,” said Eric Jaffe Levy, General Manager Print Systems, Codehost Inc,.About Codehost Inc.Founded in 1999, Codehost has emerged as the leader in Linux and Unix software development and services for leading manufacturers of printers, multi-function peripherals and imaging devices. With an expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.BrightQ, Codehost’s marquee printing application for Unix and Linux, has become the standard solution for multi-function and workgroup printer manufacturers providing advanced print support for their customers’ complex operating environments.More information about Codehost product and services can be found atwww.codehost.com.About Electronics For ImagingElectronics For Imaging, Inc. (www.efi.com)  is the world leader in digital imaging and print management solutions for commercial and enterprise printing. EFI’s award-winning technologies offer document management tools from creation to print, including high fidelity color and black and white Fiery® print servers that can output up to 2000 ppm; powerful production workflow and print management information software solutions for increased performance and cost efficiency; and an array of business-critical enterprise and mobile printing solutions. EFI has over 25 offices worldwide.Note to Editors: EFI and Fiery are registered trademarks of Electronics For Imaging, Inc. in the U.S. Patent and Trademark Office and/or certain other foreign jurisdictions. All other trademarks mentioned in this document are the property of their respective owners.",
            "content_html": "<h2 id=\"new-alliance-delivers-robust-intuitive-brightq-printing-solution-to-unix-and-linux-customers\">New alliance delivers robust, intuitive BrightQ printing solution to Unix and Linux customers</h2><p><b>Culver City and Foster City, Calif. - January 15, 2004</b> — Codehost Inc., the printing industry’s leading provider of Unix and Linux solutions, and Electronics For Imaging (EFI), the world leader in digital imaging and print management solutions for commercial and enterprise printing, today announced a strategic partnership to make the Codehost BrightQ Unix and Linux printing suite available to manufacturers of printers and multifunction devices utilizing EFI’s industry renowned Fiery print servers.</p><p>The addition of BrightQ to the EFI Fiery family of products will enable seamless integration of sophisticated data filters into the Unix and Linux printing workflow. These filters are designed to give easy access to a device’s complete feature set. EFI’s printer manufacturer partners can now increase the connectivity rate of their engines by gaining access to these additional markets.</p><p>“We are excited to partner with Codehost to bring the advantages of our robust Fiery server technology to Unix and Linux customers,” said James Lopez, Director of Product Marketing, EFI. “Users in legacy environments can now take full advantage of the functionality of their high-end color and Black &amp; White printers while increasing their productivity and enhancing their digital printing experience with all advanced software tools EFI’s Fiery print servers have to offer.”</p><p>BrightQ is a cohesive turnkey printing package that was developed to provide Unix and Linux operating systems with an intuitive yet feature-rich printing solution. BrightQ ensures that print data is filtered appropriately to capitalize upon all of the OEM output device functionality. BrightQ dramatically improves the printing experience for Unix and Linux users and simplifies the administrative tasks of installation and configuration of multiple printers and print queues on workstations and servers across the enterprise. BrightQ supports all popular distributions of Linux and multiple versions of Unix including Sun’s Solaris, Hewlett Packard’s HP-UX, AIX from IBM, FreeBSD, Irix, and the SCO operating systems. This powerful product is designed for compatibility and operates seamlessly with common Linux and Unix print spoolers, such as CUPS, BSD, and System V. BrightQ’s components can be accessed via an intuitive X Window System graphical interface, or via Linux and Unix shell based interfaces.</p><p>“The inclusion of BrightQ with the supported line of EFI print controllers will enable EFI’s partners to gain access to the rapidly growing Linux enterprise market, while at the same time capitalizing on the existing legacy Unix installations in the data center and elsewhere in the enterprise,” said Eric Jaffe Levy, General Manager Print Systems, Codehost Inc,.</p><h3 id=\"about-codehost-inc\">About Codehost Inc.</h3><p>Founded in 1999, Codehost has emerged as the leader in Linux and Unix software development and services for leading manufacturers of printers, multi-function peripherals and imaging devices. With an expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.</p><p>BrightQ, Codehost’s marquee printing application for Unix and Linux, has become the standard solution for multi-function and workgroup printer manufacturers providing advanced print support for their customers’ complex operating environments.</p><p>More information about Codehost product and services can be found at<a href=\"https://www.codehost.com\">www.codehost.com</a>.</p><h3 id=\"about-electronics-for-imaging\">About Electronics For Imaging</h3><p>Electronics For Imaging, Inc. (<a href=\"http://www.efi.com\">www.efi.com</a>)  is the world leader in digital imaging and print management solutions for commercial and enterprise printing. EFI’s award-winning technologies offer document management tools from creation to print, including high fidelity color and black and white Fiery® print servers that can output up to 2000 ppm; powerful production workflow and print management information software solutions for increased performance and cost efficiency; and an array of business-critical enterprise and mobile printing solutions. EFI has over 25 offices worldwide.</p><p><i>Note to Editors:</i> EFI and Fiery are registered trademarks of Electronics For Imaging, Inc. in the U.S. Patent and Trademark Office and/or certain other foreign jurisdictions. All other trademarks mentioned in this document are the property of their respective owners.</p>",
            "url": "https://www.codehost.com/news/2004/01/efi-and-codehost-announce-partnership.html",
            
            
            
            
            
            "date_published": "2004-01-15T00:00:00-08:00",
            "date_modified": "2004-01-15T00:00:00-08:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2003/12/brightq-available-for-mfps-worldwide.html",
            "title": "BrightQ Available for MFPs Worldwide",
            
            "content_text": "CULVER CITY, CA December 4, 2003 — Codehost, Inc. announced today that it is making BrightQ, its marquee UNIX and Linux printing solution, available to users worldwide.BrightQ is the standard Linux and UNIX printing solution for a number of OEMs, having received rave reviews from printing industry professionals and system administrators from major corporations. BrightQ provides the UNIX and Linux environment with a robust solution that supports the advanced functionality of today’s best of class multifunction printers. BrightQ is easy to install, maintain, and provides advanced print management through an intuitive graphical interface. BrightQ is available for all common versions of UNIX and Linux distributions while supporting a large number of printers including Codehost’s current customers: Canon, Savin, Lanier, Ricoh, Gestetner, Kyocera Mita and others.Historically, Codehost has focused on the North American market. With this announcement the BrightQ printing suite will be available to MFP dealers and customers in Europe, Asia, Latin America, Australia and other regions.“We have decided to make BrightQ available internationally in order to meet the increasing global end-user and dealer demand we are seeing today,” said Codehost, Inc. President and CEO Sam Bizri. “Since our product launch in April of this year, we’ve been flooded by requests for BrightQ from the European, Asian Pacific and South American markets.”Eric Levy, Codehost’s general manager of printing systems, added “BrightQ offers significant value to the ever growing global Linux community. This solution will strongly augment the value that Linux hosts gain by printing to shared resources such as the best of class output devices offered by our partners in markets outside of North America.”Evaluation versions of BrightQ are available for download from the Codehost website (www.codehost.com), or by specific manufacturer:  Canon imageRUNNER and CLC devices: www.codehost.com/canonintl  Ricoh Aficio MFPs and printers: www.codehost.com/ricoh;  Savin products: www.codehost.com/savin;  Lanier products: www.codehost.com/lanier;  Kyocera Mita products: www.codehost.com/kyoceramita.To purchase BrightQ or to request support for a manufacturer that is not listed, contact Codehost, Inc. at sales@codehost.com or at +1 (213) 254-2000.All referenced product names, and other marks, are trademarks of their respective owners.",
            "content_html": "<p><b>CULVER CITY, CA December 4, 2003</b> — Codehost, Inc. announced today that it is making BrightQ, its marquee UNIX and Linux printing solution, available to users worldwide.</p><p>BrightQ is the standard Linux and UNIX printing solution for a number of OEMs, having received rave reviews from printing industry professionals and system administrators from major corporations. BrightQ provides the UNIX and Linux environment with a robust solution that supports the advanced functionality of today’s best of class multifunction printers. BrightQ is easy to install, maintain, and provides advanced print management through an intuitive graphical interface. BrightQ is available for all common versions of UNIX and Linux distributions while supporting a large number of printers including Codehost’s current customers: Canon, Savin, Lanier, Ricoh, Gestetner, Kyocera Mita and others.</p><p>Historically, Codehost has focused on the North American market. With this announcement the BrightQ printing suite will be available to MFP dealers and customers in Europe, Asia, Latin America, Australia and other regions.<br /></p><p>“We have decided to make BrightQ available internationally in order to meet the increasing global end-user and dealer demand we are seeing today,” said Codehost, Inc. President and CEO Sam Bizri. “Since our product launch in April of this year, we’ve been flooded by requests for BrightQ from the European, Asian Pacific and South American markets.”<br /></p><p>Eric Levy, Codehost’s general manager of printing systems, added “BrightQ offers significant value to the ever growing global Linux community. This solution will strongly augment the value that Linux hosts gain by printing to shared resources such as the best of class output devices offered by our partners in markets outside of North America.”<br /></p><p>Evaluation versions of BrightQ are available for download from the Codehost website (www.codehost.com), or by specific manufacturer:</p><ul>  <li><b>Canon</b> imageRUNNER and CLC devices: <a href=\"https://www.codehost.com/canonintl\">www.codehost.com/canonintl</a></li>  <li><b>Ricoh</b> Aficio MFPs and printers: <a href=\"https://www.codehost.com/ricoh\">www.codehost.com/ricoh</a>;</li>  <li><b>Savin</b> products: <a href=\"https://www.codehost.com/savin/\">www.codehost.com/savin</a>;</li>  <li><b>Lanier</b> products: <a href=\"https://www.codehost.com/lanier/\">www.codehost.com/lanier</a>;</li>  <li><b>Kyocera Mita</b> products: <a href=\"https://www.codehost.com/kyoceramita\">www.codehost.com/kyoceramita</a>.</li></ul><p>To purchase BrightQ or to request support for a manufacturer that is not listed, contact Codehost, Inc. at <a href=\"mailto:sales@codehost.com\">sales@codehost.com</a> or at <a href=\"tel:+12132542000\">+1 (213) 254-2000</a>.</p><p>All referenced product names, and other marks, are trademarks of their respective owners.</p>",
            "url": "https://www.codehost.com/news/2003/12/brightq-available-for-mfps-worldwide.html",
            
            
            
            
            
            "date_published": "2003-12-04T00:00:00-08:00",
            "date_modified": "2003-12-04T00:00:00-08:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2003/11/brightq-1.6.5-available.html",
            "title": "BrightQ 1.6.5 Available",
            
            "content_text": "CULVER CITY, CA November 10, 2003 — Codehost Inc. has announced the availability of the 1.6.5 upgrade to BrightQ. It is highly recommended that those using BrightQ 1.6.4 or earlier versions, upgrade to this newest release. BrightQ 1.6.5 contains a number of product enhancements across all platforms that dramatically improve overall product performance.Those running BrightQ in the System V (or lp) printing environments will greatly benefit from 1.6.5, as a number of back-end changes have been made to optimize the product’s performance and reliability on these systems. The System V printing architecture is most commonly associated with the Sun Solaris, Hewlett-Packard HP-UX, AIX and SCO supported UNIX operating environments. When upgrading, version 1.6.5 can be installed directly over an existing 1.6.4 version of BrightQ.This upgrade affects all current OEM partners who are using BrightQ as their enterprise Linux and UNIX printing solution. Downloads and upgrades can be found at each OEMs respective download site:  Canon USA and Canada downloads: canon.codehost.com  Canon downloads outside of USA and Canada: canonintl.codehost.com  Ricoh, Gestetner and Lanier downloads: ricoh.codehost.com  Savin downloads: savin.codehost.com  Kyocera Mita downloads: kyoceramita.codehost.comIf you would like to request a demo for an OEM not listed above, please visit the Codehost Inc. website at www.codehost.com.",
            "content_html": "<p><b>CULVER CITY, CA November 10, 2003</b> — Codehost Inc. has announced the availability of the 1.6.5 upgrade to BrightQ. It is highly recommended that those using BrightQ 1.6.4 or earlier versions, upgrade to this newest release. BrightQ 1.6.5 contains a number of product enhancements across all platforms that dramatically improve overall product performance.</p><p>Those running BrightQ in the System V (or lp) printing environments will greatly benefit from 1.6.5, as a number of back-end changes have been made to optimize the product’s performance and reliability on these systems. The System V printing architecture is most commonly associated with the Sun Solaris, Hewlett-Packard HP-UX, AIX and SCO supported UNIX operating environments. When upgrading, version 1.6.5 can be installed directly over an existing 1.6.4 version of BrightQ.</p><p>This upgrade affects all current OEM partners who are using BrightQ as their enterprise Linux and UNIX printing solution. Downloads and upgrades can be found at each OEMs respective download site:</p><ul>  <li>Canon USA and Canada downloads: <a href=\"http://canon.codehost.com\">canon.codehost.com</a></li>  <li>Canon downloads outside of USA and Canada: <a href=\"http://canonintl.codehost.com\">canonintl.codehost.com</a></li>  <li>Ricoh, Gestetner and Lanier downloads: <a href=\"http://ricoh.codehost.com\">ricoh.codehost.com</a></li>  <li>Savin downloads: <a href=\"http://savin.codehost.com\">savin.codehost.com</a></li>  <li>Kyocera Mita downloads: <a href=\"http://kyoceramita.codehost.com\">kyoceramita.codehost.com</a></li></ul><p>If you would like to request a demo for an OEM not listed above, please visit the Codehost Inc. website at <a href=\"https://www.codehost.com\">www.codehost.com</a>.</p>",
            "url": "https://www.codehost.com/news/2003/11/brightq-1.6.5-available.html",
            
            
            
            
            
            "date_published": "2003-11-11T00:00:00-08:00",
            "date_modified": "2003-11-11T00:00:00-08:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2003/08/codehost-releases-brightq-1.6.4.html",
            "title": "Codehost Releases BrightQ 1.6.4",
            
            "content_text": "The latest version of Codehost’s UNIX and Linux printing suite includes advanced features and support for additional UNIX operating systemsCULVER CITY, CA — Codehost Inc. announced today the availability of the 1.6.4 version of the BrightQ printing suite. The latest release of this cohesive printer driver package for the UNIX and Linux operating systems includes additional feature functionality and support for two additional versions of UNIX running on the x86 platform; Solaris 8 and FreeBSD (version 4.6 and above).“We feel that providing support for these popular versions of UNIX gives our printer OEM partners a greater market reach for their devices, while addressing the growing need for robust UNIX printing solutions,” said Codehost CEO, Sam Bizri.The BrightQ printing suite provides an easy-to-use printing interface driving multi-function devices and high-end workgroup printers. BrightQ gives users access to all available printer finishing features for a number of versions of UNIX and distributions of Linux.New features of the product are highlighted by an advanced license activation manager and full command line interface support. Codehost’s proprietary license activation manager gives users of BrightQ the capacity to upgrade feature functionality and add support for additional devices without having to replace the core software.Additionally, all of BrightQ’s advanced features can now be accessed through the command line interface within UNIX and Linux environments. This includes command line access to BrightInstall (Codehost’s UNIX and Linux installation tool), the BrightQ configuration tool for setting up printers and print queues, and the product registration module. Having full command line access to BrightQ provides support to those environments not running X windows and an alternative to users who prefer printing without an interface.At Linux World in August, Codehost announced the availability of BrightQ for Codehost’s most recent multi-function and workgroup printer partner, Kyocera Mita. BrightQ (Linux and UNIX printer driver) downloads for Kyocera Mita can be found at kyoceramita.codehost.com.Additional OEM downloads of BrightQ downloads and documentation, as well as information on Linux and UNIX printing can be found atwww.codehost.com.About Codehost Inc.Founded in 1999, Codehost has emerged as the leader in Linux and UNIX software development for leading manufacturers of printers and multi-function devices. With an expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.BrightQ™ was chosen as a finalist for the Best Desktop Office Solution award during the Linux World 2002 in San Francisco. You can learn more about Codehost’s UNIX and Linux printing products and services atwww.codehost.com.All referenced product names, and other marks, are trademarks of their respective owners.",
            "content_html": "<h2 id=\"the-latest-version-of-codehosts-unix-and-linux-printing-suite-includes-advanced-features-and-support-for-additional-unix-operating-systems\">The latest version of Codehost’s UNIX and Linux printing suite includes advanced features and support for additional UNIX operating systems</h2><p><b>CULVER CITY, CA</b> — Codehost Inc. announced today the availability of the 1.6.4 version of the BrightQ printing suite. The latest release of this cohesive printer driver package for the UNIX and Linux operating systems includes additional feature functionality and support for two additional versions of UNIX running on the x86 platform; Solaris 8 and FreeBSD (version 4.6 and above).</p><p>“We feel that providing support for these popular versions of UNIX gives our printer OEM partners a greater market reach for their devices, while addressing the growing need for robust UNIX printing solutions,” said Codehost CEO, Sam Bizri.</p><p>The BrightQ printing suite provides an easy-to-use printing interface driving multi-function devices and high-end workgroup printers. BrightQ gives users access to all available printer finishing features for a number of versions of UNIX and distributions of Linux.</p><p>New features of the product are highlighted by an advanced license activation manager and full command line interface support. Codehost’s proprietary license activation manager gives users of BrightQ the capacity to upgrade feature functionality and add support for additional devices without having to replace the core software.</p><p>Additionally, all of BrightQ’s advanced features can now be accessed through the command line interface within UNIX and Linux environments. This includes command line access to BrightInstall (Codehost’s UNIX and Linux installation tool), the BrightQ configuration tool for setting up printers and print queues, and the product registration module. Having full command line access to BrightQ provides support to those environments not running X windows and an alternative to users who prefer printing without an interface.</p><p>At Linux World in August, Codehost announced the availability of BrightQ for Codehost’s most recent multi-function and workgroup printer partner, Kyocera Mita. BrightQ (Linux and UNIX printer driver) downloads for Kyocera Mita can be found at <a href=\"http://kyoceramita.codehost.com\">kyoceramita.codehost.com</a>.</p><p>Additional OEM downloads of BrightQ downloads and documentation, as well as information on Linux and UNIX printing can be found at<a href=\"https://www.codehost.com\">www.codehost.com</a>.</p><h3 id=\"about-codehost-inc\">About Codehost Inc.</h3><p>Founded in 1999, Codehost has emerged as the leader in Linux and UNIX software development for leading manufacturers of printers and multi-function devices. With an expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.</p><p>BrightQ™ was chosen as a finalist for the Best Desktop Office Solution award during the Linux World 2002 in San Francisco. You can learn more about Codehost’s UNIX and Linux printing products and services at<a href=\"https://www.codehost.com\">www.codehost.com</a>.</p><p>All referenced product names, and other marks, are trademarks of their respective owners.</p>",
            "url": "https://www.codehost.com/news/2003/08/codehost-releases-brightq-1.6.4.html",
            
            
            
            
            
            "date_published": "2003-08-28T00:00:00-07:00",
            "date_modified": "2003-08-28T00:00:00-07:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2003/08/brightq-now-available-for-kyocera-mita.html",
            "title": "BrightQ Now Available For Kyocera Mita",
            
            "content_text": "Codehost’s BrightQ Printing Suite now available for Kyocera Mita Printers and Multi-Functional Products (MFPs)Fairfield, New Jersey and Culver City, California - August 6, 2003  — Kyocera Mita, one of the world’s leading document imaging companies, and Codehost, Inc., a leading provider of software solutions for manufacturers within the printing and imaging markets, today announced the availability of Codehost’s BrightQ™ suite of Linux and Unix-based printing tools for use with Kyocera Mita’s ECOSYS printers and multi-functional products (MFPs).“Through the Kyocera Mita version of BrightQ, users will be able to easily install and configure their Kyocera Mita printers and MFPs, which is critical to today’s Linux and UNIX users,” said Michael Pietrunti, vice president, marketing for Kyocera Mita America.  “Along with BrightQ, our strong product line and a low total cost of ownership, we believe that we’ll be better able to service and support the growing Linux and UNIX market.”Developed for UNIX and Linux operating systems, BrightQ™ gives administrators and users an easy-to-use printing environment, allowing users to take advantage of the full functionality of their high-end printers.  BrightQ™ is geared specifically to provide original equipment manufacturers and value added resellers with a solution that provides their UNIX and Linux customers with a highly intuitive and robust printing solution.  This dynamic printing suite is customizable for nearly any line of consumer, industrial or back-office printer.“Codehost is excited to launch BrightQ into the Kyocera Mita channel,” said Codehost CEO Sam Bizri. “With our expertise and ability to support the Linux and UNIX printing environment, we feel we are offering Kyocera Mita customers the most complete solution available for users of multi-function devices and printers in these environments.”BrightQ supports all commonly used versions of UNIX and distributions of Linux. Codehost will be exhibiting BrightQ from August 5-7 at Linux World 2003 in San Francisco (Booth 774). Kyocera Mita dealers and customers can view a complete list of supported devices and download demos of BrightQ at kyoceramita.codehost.com.ABOUT CODEHOST, INC.Founded in 1999, Codehost has emerged as the leader in Linux and UNIX software development for leading manufacturers of printers and multi-function devices.  With an expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.  BrightQ™ was chosen as a finalist for the Best Desktop Office Solution award during the LinuxWorld 2002 in San Francisco.You can learn more about Codehost’s UNIX and Linux printing products and services at www.codehost.comABOUT KYOCERA MITAKyocera Mita is one of the world’s largest manufacturers and leading providers of computer-connectable peripherals, including network-ready digital copiers/printers, laser printers, color copiers/printers, digital laser facsimiles, multi-functional and wide format imaging solutions.  Kyocera Mita is a group company of Kyocera Corporation, the world’s leading developer and manufacturer of advanced ceramics and associated products, including telecommunications equipment, semiconductor packages and electronic components.  Kyocera Corporation’s consolidated net revenues totaled $9.0 billion during the year ended March 31, 2002.  Kyocera Mita’s headquarters for the Americas are in Fairfield, New Jersey.For more information, visit www.kyoceramita.com",
            "content_html": "<h2 id=\"codehosts-brightq-printing-suite-now-available-for-kyocera-mita-printers-and-multi-functional-products-mfps\">Codehost’s BrightQ Printing Suite now available for Kyocera Mita Printers and Multi-Functional Products (MFPs)</h2><p><b>Fairfield, New Jersey and Culver City, California - August 6, 2003 </b> — Kyocera Mita, one of the world’s leading document imaging companies, and Codehost, Inc., a leading provider of software solutions for manufacturers within the printing and imaging markets, today announced the availability of Codehost’s BrightQ™ suite of Linux and Unix-based printing tools for use with Kyocera Mita’s ECOSYS printers and multi-functional products (MFPs).</p><p>“Through the Kyocera Mita version of BrightQ, users will be able to easily install and configure their Kyocera Mita printers and MFPs, which is critical to today’s Linux and UNIX users,” said Michael Pietrunti, vice president, marketing for Kyocera Mita America.  “Along with BrightQ, our strong product line and a low total cost of ownership, we believe that we’ll be better able to service and support the growing Linux and UNIX market.”</p><p>Developed for UNIX and Linux operating systems, BrightQ™ gives administrators and users an easy-to-use printing environment, allowing users to take advantage of the full functionality of their high-end printers.  BrightQ™ is geared specifically to provide original equipment manufacturers and value added resellers with a solution that provides their UNIX and Linux customers with a highly intuitive and robust printing solution.  This dynamic printing suite is customizable for nearly any line of consumer, industrial or back-office printer.</p><p>“Codehost is excited to launch BrightQ into the Kyocera Mita channel,” said Codehost CEO Sam Bizri. “With our expertise and ability to support the Linux and UNIX printing environment, we feel we are offering Kyocera Mita customers the most complete solution available for users of multi-function devices and printers in these environments.”</p><p>BrightQ supports all commonly used versions of UNIX and distributions of Linux. Codehost will be exhibiting BrightQ from August 5-7 at Linux World 2003 in San Francisco (Booth 774). <br /><br />Kyocera Mita dealers and customers can view a complete list of supported devices and download demos of BrightQ at <a href=\"http://kyoceramita.codehost.com\">kyoceramita.codehost.com</a>.</p><h3 id=\"about-codehost-inc\">ABOUT CODEHOST, INC.</h3><p>Founded in 1999, Codehost has emerged as the leader in Linux and UNIX software development for leading manufacturers of printers and multi-function devices.  With an expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.  BrightQ™ was chosen as a finalist for the Best Desktop Office Solution award during the LinuxWorld 2002 in San Francisco.You can learn more about Codehost’s UNIX and Linux printing products and services at <a href=\"https://www.codehost.com\">www.codehost.com</a></p><h3 id=\"about-kyocera-mita\">ABOUT KYOCERA MITA</h3><p>Kyocera Mita is one of the world’s largest manufacturers and leading providers of computer-connectable peripherals, including network-ready digital copiers/printers, laser printers, color copiers/printers, digital laser facsimiles, multi-functional and wide format imaging solutions.  Kyocera Mita is a group company of Kyocera Corporation, the world’s leading developer and manufacturer of advanced ceramics and associated products, including telecommunications equipment, semiconductor packages and electronic components.  Kyocera Corporation’s consolidated net revenues totaled $9.0 billion during the year ended March 31, 2002.  Kyocera Mita’s headquarters for the Americas are in Fairfield, New Jersey.</p><p>For more information, visit <a href=\"http://www.kyoceramita.com\">www.kyoceramita.com</a></p>",
            "url": "https://www.codehost.com/news/2003/08/brightq-now-available-for-kyocera-mita.html",
            
            
            
            
            
            "date_published": "2003-08-06T00:00:00-07:00",
            "date_modified": "2003-08-06T00:00:00-07:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2003/06/gestetner-to-offer-brightq.html",
            "title": "Gestetner To Offer BrightQ",
            
            "content_text": "Gestetner to Make the BrightQ™ Printing Solution for UNIX and Linux Available for Line of Networked Imaging SystemsSTAMFORD, CT and CULVER CITY, CA - May 22, 2003  — Gestetner announced today that is has aligned with Unix and Linux software developer Codehost Inc. to offerGestetner customers and dealers BrightQ™, Codehost’s popular suite of Linux and Unix-based printing tools, for use with Savin networked output systems.“Linux and Unix applications play an increasingly important role in enterprises, and ensuring that our imaging systems work seamlessly with them is important to many of our customers,” said Mark Pollack, vice president of marketing and marketing support. “BrightQ is a flexible and powerful solution that we will provide to our steadily increasing base of Linux and Unix users.”BrightQ will be available for select models of Gestetner’s line of products, delivering customers within the Linux and UNIX environments a robust, easy-to-use solution that provides complete access to the advanced document finishing features found on many of Savin’s systems.“Codehost is very pleased to be working with Gestetner. We feel BrightQ offers great value to their dealers and distributors, providing them with a solution that satisfies corporate printing needs generated by the growing use of Linux and high dependency on UNIX systems,” said Codehost CEO Sam Bizri. “They can support their customers’ technology platforms with minimal effort, and increase their value proposition by providing a full suite of solutions supporting UNIX and Linux alongside Windows.”BrightQ is comprised of intuitive graphical interfaces that allow users to manage printers, complex print jobs and sophisticated print queues, while providing support for industry standard printing protocols. A key component of BrightQ is Codehost’s BrightInstall™, an installation tool that enables systems support personnel to easily install, configure, and support their Unix/Linux customer base. BrightQ supports most major UNIX operating systems and Linux distributions.BrightQ was chosen as finalist for the Best Desktop Office Solution award during the LinuxWorld 2002 in San Francisco.About Codehost Inc.Founded in 1999, Codehost has emerged as the leader in Linux and UNIX software development and services for leading manufacturers of printers, multi-function and imaging devices. With an expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments. For more information on Codehost, Inc. products and services, please visit www.codehost.comBrightQ is currently a nominee for The 2003 LBT Readers Choice Awards under the category of “The Best Linux Productivity Tool.” You can cast your vote for the Best Linux Applications in 14 categories by visiting www.sys-con.com/linux.About GestetnerGestetner’s broad line of award winning line of network-ready digital output systems including full color and black-and-white digital imaging systems, color and black-and-white network laser printers, and fax machines delivers document output solutions for businesses of all sizes, at speeds from 10 to 105 ppm. Buyers Laboratory, Inc. (BLI) recognized four Gestetner systems with “Pick of the Year” awards in 2002, including the 1802, 3222, 3355, and 10502 Digital Imaging Systems. Gestetner document management systems are marketed by a nationwide network of dealers. Gestetner is a brand of Stamford, CT-based Savin Corp. For more information, visit www.gestetnerusa.com.",
            "content_html": "<h2 id=\"gestetner-to-make-the-brightq-printing-solution-for-unix-and-linux-available-for-line-of-networked-imaging-systems\">Gestetner to Make the BrightQ™ Printing Solution for UNIX and Linux Available for Line of Networked Imaging Systems</h2><p><b>STAMFORD, CT and CULVER CITY, CA - May 22, 2003 </b> — Gestetner announced today that is has aligned with Unix and Linux software developer Codehost Inc. to offer</p><p>Gestetner customers and dealers BrightQ™, Codehost’s popular suite of Linux and Unix-based printing tools, for use with Savin networked output systems.</p><p>“Linux and Unix applications play an increasingly important role in enterprises, and ensuring that our imaging systems work seamlessly with them is important to many of our customers,” said Mark Pollack, vice president of marketing and marketing support. “BrightQ is a flexible and powerful solution that we will provide to our steadily increasing base of Linux and Unix users.”</p><p>BrightQ will be available for select models of Gestetner’s line of products, delivering customers within the Linux and UNIX environments a robust, easy-to-use solution that provides complete access to the advanced document finishing features found on many of Savin’s systems.</p><p>“Codehost is very pleased to be working with Gestetner. We feel BrightQ offers great value to their dealers and distributors, providing them with a solution that satisfies corporate printing needs generated by the growing use of Linux and high dependency on UNIX systems,” said Codehost CEO Sam Bizri. “They can support their customers’ technology platforms with minimal effort, and increase their value proposition by providing a full suite of solutions supporting UNIX and Linux alongside Windows.”</p><p>BrightQ is comprised of intuitive graphical interfaces that allow users to manage printers, complex print jobs and sophisticated print queues, while providing support for industry standard printing protocols. A key component of BrightQ is Codehost’s BrightInstall™, an installation tool that enables systems support personnel to easily install, configure, and support their Unix/Linux customer base. BrightQ supports most major UNIX operating systems and Linux distributions.</p><p>BrightQ was chosen as finalist for the Best Desktop Office Solution award during the LinuxWorld 2002 in San Francisco.</p><h3 id=\"about-codehost-inc\">About Codehost Inc.</h3><p>Founded in 1999, Codehost has emerged as the leader in Linux and UNIX software development and services for leading manufacturers of printers, multi-function and imaging devices. With an expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments. For more information on Codehost, Inc. products and services, please visit <a href=\"https://www.codehost.com\">www.codehost.com</a></p><p>BrightQ is currently a nominee for The 2003 LBT Readers Choice Awards under the category of “The Best Linux Productivity Tool.” You can cast your vote for the Best Linux Applications in 14 categories by visiting <a href=\"http://www.sys-con.com/linux\">www.sys-con.com/linux</a>.</p><h3 id=\"about-gestetner\">About Gestetner</h3><p>Gestetner’s broad line of award winning line of network-ready digital output systems including full color and black-and-white digital imaging systems, color and black-and-white network laser printers, and fax machines delivers document output solutions for businesses of all sizes, at speeds from 10 to 105 ppm. Buyers Laboratory, Inc. (BLI) recognized four Gestetner systems with “Pick of the Year” awards in 2002, including the 1802, 3222, 3355, and 10502 Digital Imaging Systems. Gestetner document management systems are marketed by a nationwide network of dealers. Gestetner is a brand of Stamford, CT-based Savin Corp. For more information, visit <a href=\"http://www.gestetnerusa.com\">www.gestetnerusa.com</a>.</p>",
            "url": "https://www.codehost.com/news/2003/06/gestetner-to-offer-brightq.html",
            
            
            
            
            
            "date_published": "2003-06-04T00:00:00-07:00",
            "date_modified": "2003-06-04T00:00:00-07:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2003/05/savin-announces-brightq-distribution.html",
            "title": "Savin Announces BrightQ Distribution",
            
            "content_text": "Savin to Make the BrightQ™ Printing Solution for UNIX and Linux Available for Line of Networked Imaging SystemsSTAMFORD, CT and CULVER CITY, CA. - May 22, 2003  — Savin Corporation announced today that is has aligned with Unix and Linux software developer Codehost Inc. to offer Savin customers and dealers BrightQ™, Codehost’s popular suite of Linux and Unix-based printing tools, for use with Savin networked output systems.“Linux and Unix applications play an increasingly important role in enterprises, and ensuring that our imaging systems work seamlessly with them is important to many of our customers,” said Mark Pollack, vice president of marketing and marketing support.  “BrightQ is a flexible and powerful solution that we will provide to our steadily increasing base of Linux and Unix users.”BrightQ will be available for select models of Savin’s line of products, delivering customers within the Linux and UNIX environments a robust, easy-to-use solution that provides complete access to the advanced document finishing features found on many of Savin’s systems.“Codehost is very pleased to be working with Savin. We feel BrightQ™ offers great value to their dealers, providing them with a solution that satisfies corporate printing needs generated by the growing use of Linux and high dependency on UNIX systems,” said Codehost CEO Sam Bizri.  “They can support their customers’ technology platforms with minimal effort, and increase their value proposition by providing a full suite of solutions supporting UNIX and Linux alongside Windows.”BrightQ is comprised of intuitive graphical interfaces that allow users to manage printers, complex print jobs and sophisticated print queues, while providing support for industry standard printing protocols. A key component of BrightQ is Codehost’s BrightInstall™, an installation tool that enables systems support personnel to easily install, configure, and support their Unix/Linux customer base. BrightQ supports most major UNIX operating systems and Linux distributions.BrightQ was chosen as finalist for the Best Desktop Office Solution award during the LinuxWorld 2002 in San Francisco.About Codehost Inc.Founded in 1999, Codehost has emerged as the leader in Linux and UNIX software development and services for leading manufacturers of printers, multi-function and imaging devices. With an expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.BrightQ is currently a nominee for The 2003 LBT Readers Choice Awards under the category of “The Best Linux Productivity Tool.” You can cast your vote for the Best Linux Applications in 14 categories by visiting www.sys-con.com/linux.More information about Codehost product and services can be found at www.codehost.com.About Savin Corp.With its broad line of award winning network-ready digital output systems including full color and black-and-white digital imaging systems, color and black-and-white network laser printers, and fax machines Savin is helping businesses of all sizes become more productive and efficient.  Buyers Laboratory, Inc. (BLI) recognized four Savin systems with “Pick of the Year” awards in 2002, including the 2518, 9922DP, 2055DP, and 25105 Digital Imaging Systems.  Savin scored among the top brands in the inaugural J.D. Power and Associates Black-and-White Copier/Multifunction Product Customer Satisfaction Study, scoring higher than the industry average for overall product customer satisfaction.  The company markets its products through a nationwide branch office and dealer network.  Savin is based in Stamford, CT.  For more information, visit www.savin.com.",
            "content_html": "<h2 id=\"savin-to-make-the-brightq-printing-solution-for-unix-and-linux-available-for-line-of-networked-imaging-systems\">Savin to Make the BrightQ™ Printing Solution for UNIX and Linux Available for Line of Networked Imaging Systems</h2><p><b>STAMFORD, CT and CULVER CITY, CA. - May 22, 2003 </b> — Savin Corporation announced today that is has aligned with Unix and Linux software developer Codehost Inc. to offer Savin customers and dealers BrightQ™, Codehost’s popular suite of Linux and Unix-based printing tools, for use with Savin networked output systems.</p><p>“Linux and Unix applications play an increasingly important role in enterprises, and ensuring that our imaging systems work seamlessly with them is important to many of our customers,” said Mark Pollack, vice president of marketing and marketing support.  “BrightQ is a flexible and powerful solution that we will provide to our steadily increasing base of Linux and Unix users.”</p><p>BrightQ will be available for select models of Savin’s line of products, delivering customers within the Linux and UNIX environments a robust, easy-to-use solution that provides complete access to the advanced document finishing features found on many of Savin’s systems.</p><p>“Codehost is very pleased to be working with Savin. We feel BrightQ™ offers great value to their dealers, providing them with a solution that satisfies corporate printing needs generated by the growing use of Linux and high dependency on UNIX systems,” said Codehost CEO Sam Bizri.  “They can support their customers’ technology platforms with minimal effort, and increase their value proposition by providing a full suite of solutions supporting UNIX and Linux alongside Windows.”</p><p>BrightQ is comprised of intuitive graphical interfaces that allow users to manage printers, complex print jobs and sophisticated print queues, while providing support for industry standard printing protocols. A key component of BrightQ is Codehost’s BrightInstall™, an installation tool that enables systems support personnel to easily install, configure, and support their Unix/Linux customer base. BrightQ supports most major UNIX operating systems and Linux distributions.</p><p>BrightQ was chosen as finalist for the Best Desktop Office Solution award during the LinuxWorld 2002 in San Francisco.</p><h3 id=\"about-codehost-inc\">About Codehost Inc.</h3><p>Founded in 1999, Codehost has emerged as the leader in Linux and UNIX software development and services for leading manufacturers of printers, multi-function and imaging devices. With an expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.</p><p>BrightQ is currently a nominee for The 2003 LBT Readers Choice Awards under the category of “The Best Linux Productivity Tool.” You can cast your vote for the Best Linux Applications in 14 categories by visiting <a href=\"http://www.sys-con.com/linux\">www.sys-con.com/linux</a>.</p><p>More information about Codehost product and services can be found at <a href=\"https://www.codehost.com\">www.codehost.com</a>.</p><h3 id=\"about-savin-corp\">About Savin Corp.</h3><p>With its broad line of award winning network-ready digital output systems including full color and black-and-white digital imaging systems, color and black-and-white network laser printers, and fax machines Savin is helping businesses of all sizes become more productive and efficient.  Buyers Laboratory, Inc. (BLI) recognized four Savin systems with “Pick of the Year” awards in 2002, including the 2518, 9922DP, 2055DP, and 25105 Digital Imaging Systems.  Savin scored among the top brands in the inaugural J.D. Power and Associates Black-and-White Copier/Multifunction Product Customer Satisfaction Study, scoring higher than the industry average for overall product customer satisfaction.  The company markets its products through a nationwide branch office and dealer network.  Savin is based in Stamford, CT.  For more information, visit <a href=\"http://www.savin.com\">www.savin.com</a>.</p>",
            "url": "https://www.codehost.com/news/2003/05/savin-announces-brightq-distribution.html",
            
            
            
            
            
            "date_published": "2003-05-22T00:00:00-07:00",
            "date_modified": "2003-05-22T00:00:00-07:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2003/05/codehost-announces-support-for-freebsd.html",
            "title": "Codehost Announces Support For FreeBSD",
            
            "content_text": "Codehost makes the BrightQ™ printing solution for multi-function devices and printers available for the FreeBSD operating environment.CULVER CITY, CA - MAY 14, 2003 — Codehost Inc., a leading provider of software solutions for hardware manufacturers within the printing and imaging markets, today announced that it’s BrightQ™ printing suite will support the FreeBSD operating system.BrightQ™ provides administrators and users of various flavors of Unix, Linux, and now FreeBSD, with an easy-to-use, graphically-rich, printing environment, and easy-to-configure and support service protocol suite.  The turnkey package allows end users to take full advantage of a multi-function devices or a printers advanced finishing capabilities, while still capitalizing on the strengths of their mission critical applications.“While FreeBSD may not yet have the recognition of other free Unix operating systems, it is being utilized within countless [corporate] IT environments as a backbone for everyday IT solutions,” said Sam Bizri, president and CEO of Codehost. “In releasing BrightQ for FreeBSD, we’re doing our part by providing professional printing tools for serious operating systems.”FreeBSD is an advanced operating system that supports a number of hardware architectures including x86 and UltraSPARC. It is derived from BSD Unix and offers advanced networking, performance, security and compatibility features which are unavailable in some commercial operating environments. Like Linux, FreeBSD and its source code, are free of licensing costs.“As a FreeBSD user, I’m more than happy to assist in releasing the necessary printing tools to a robust Unix operating system like FreeBSD. BrightQ’s cross-platform nature allows us to supply this printing solution between a robust Unix OS and high-end printing equipment,” said Rafael A. Barrero, a senior sytems engineer at Codehost.BrightQ™, in addition to providing full feature support to the FreeBSD printing environment, will also provide a turnkey print driver interface, support for industry standard printing protocols, and a queuing system that is simple, intuitive, and cohesive across Unix operating systems and Linux distributions.BrightQ™ offers support for most major UNIX operating systems and Linux distributions. The BrightQ FreeBSD release will support FreeBSD 4.0 and above. Codehost distributes its product through its OEM partners and their dealer channels. Companies currently offering BrightQ include Canon, Ricoh, Savin, Lanier, Gestettner and Kyocera Mita.On April 14 Canon announced the availability of BrightQ for its imageRUNNER, CLC and wide format printers. You can learn more about Codehost and download BrightQ materials by visiting www.codehost.com.About Codehost, Inc.Founded in 1999, Codehost has emerged as the leader in Linux and UNIX software development for leading manufacturers of printers and multi-function devices.  With an expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.BrightQ™ was chosen as a finalist for the Best Desktop Office Solution award during the LinuxWorld 2002 in San Francisco. You can learn more about BrightQ™ and additional Codehost products and services by visiting www.codehost.com.  BrightQ is currently a nominee for The 2003 LBT Readers Choice Awards under the category of “The Best Linux Productivity Tool.” You can cast your vote for the Best Linux Applications in 14 categories by visiting www.sys-con.com/linux.",
            "content_html": "<h2 id=\"codehost-makes-the-brightq-printing-solution-for-multi-function-devices-and-printers-available-for-the-freebsd-operating-environment\">Codehost makes the BrightQ™ printing solution for multi-function devices and printers available for the FreeBSD operating environment.</h2><p><b>CULVER CITY, CA - MAY 14, 2003</b> — Codehost Inc., a leading provider of software solutions for hardware manufacturers within the printing and imaging markets, today announced that it’s BrightQ™ printing suite will support the FreeBSD operating system.</p><p>BrightQ™ provides administrators and users of various flavors of Unix, Linux, and now FreeBSD, with an easy-to-use, graphically-rich, printing environment, and easy-to-configure and support service protocol suite.  The turnkey package allows end users to take full advantage of a multi-function devices or a printers advanced finishing capabilities, while still capitalizing on the strengths of their mission critical applications.</p><p>“While FreeBSD may not yet have the recognition of other free Unix operating systems, it is being utilized within countless [corporate] IT environments as a backbone for everyday IT solutions,” said Sam Bizri, president and CEO of Codehost. “In releasing BrightQ for FreeBSD, we’re doing our part by providing professional printing tools for serious operating systems.”</p><p>FreeBSD is an advanced operating system that supports a number of hardware architectures including x86 and UltraSPARC. It is derived from BSD Unix and offers advanced networking, performance, security and compatibility features which are unavailable in some commercial operating environments. Like Linux, FreeBSD and its source code, are free of licensing costs.</p><p>“As a FreeBSD user, I’m more than happy to assist in releasing the necessary printing tools to a robust Unix operating system like FreeBSD. BrightQ’s cross-platform nature allows us to supply this printing solution between a robust Unix OS and high-end printing equipment,” said Rafael A. Barrero, a senior sytems engineer at Codehost.</p><p>BrightQ™, in addition to providing full feature support to the FreeBSD printing environment, will also provide a turnkey print driver interface, support for industry standard printing protocols, and a queuing system that is simple, intuitive, and cohesive across Unix operating systems and Linux distributions.</p><p>BrightQ™ offers support for most major UNIX operating systems and Linux distributions. The BrightQ FreeBSD release will support FreeBSD 4.0 and above. Codehost distributes its product through its OEM partners and their dealer channels. Companies currently offering BrightQ include Canon, Ricoh, Savin, Lanier, Gestettner and Kyocera Mita.</p><p>On April 14 Canon announced the availability of BrightQ for its imageRUNNER, CLC and wide format printers. You can learn more about Codehost and download BrightQ materials by visiting <a href=\"https://www.codehost.com\">www.codehost.com</a>.</p><h3 id=\"about-codehost-inc\">About Codehost, Inc.</h3><p>Founded in 1999, Codehost has emerged as the leader in Linux and UNIX software development for leading manufacturers of printers and multi-function devices.  With an expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.</p><p>BrightQ™ was chosen as a finalist for the Best Desktop Office Solution award during the LinuxWorld 2002 in San Francisco. You can learn more about BrightQ™ and additional Codehost products and services by visiting www.codehost.com.  BrightQ is currently a nominee for The 2003 LBT Readers Choice Awards under the category of “The Best Linux Productivity Tool.” You can cast your vote for the Best Linux Applications in 14 categories by visiting <a href=\"http://www.sys-con.com/linux\">www.sys-con.com/linux</a>.</p>",
            "url": "https://www.codehost.com/news/2003/05/codehost-announces-support-for-freebsd.html",
            
            
            
            
            
            "date_published": "2003-05-14T00:00:00-07:00",
            "date_modified": "2003-05-14T00:00:00-07:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2003/04/brightq-available-for-canon-devices.html",
            "title": "BrightQ Available For Canon Devices",
            
            "content_text": "CANON U.S.A. AND CODEHOST ANNOUNCE FULL FEATURE LINUX AND UNIX PRINTING FOR imageRUNNER, CLC, AND WIDE FORMAT DEVICESLAKE SUCCESS, NY and CULVER CITY, CA - April 21, 2003 — Canon U.S.A., Inc., a subsidiary of Canon Inc. (NYSE: CAJ), and industry leader in networked imaging solutions, and Codehost Inc., a leading provider of software solutions for manufacturers within the printing and imaging markets, today announced the availability of Codehost’s BrightQ™ suite of Linux and Unix-based printing tools for use with specific models of Canon’s imageRUNNER line of multi-function devices, CLC Color Laser Copier/Printers, and wide format printers.BrightQ supplies systems administrators, IT and OEM support personnel, and anyone who prints via Linux and Unix with an easy-to-use, graphically-rich, printing environment, and easy-to-configure and support service protocol suite.  The turnkey package allows end users to take full advantage of available Canon imageRUNNER advanced finishing capabilities, such as single and multi-position stapling, automatic 2/3 hole punching and saddle-stitch booklet making, and support for Z-folding and document insertion via additional accessories, while still capitalizing on the strengths of their Linux and Unix applications.  Canon CLC devices and BJ-W9000 wide format printer will now also be able to print on Linux and Unix.“Canon U.S.A. is very pleased to be the first to market with BrightQ, which helps strengthen the range of operating systems that our highly successful imageRUNNER, CLC, and wide format lines can print through,” said Dennis Amorosano, director and assistant general manager of Canon U.S.A.’s Integrated Business Systems Division.  “The intuitive BrightQ interface, coupled with Canon’s industry leading document handling and finishing capabilities, significantly advances the printing power available to Linux and Unix users, thereby more effectively supporting their application requirements.”“Codehost is excited about the launch and the future of this product within the Canon’s product lines,” said President and CEO of Codehost, Sam Bizri. “We will continue to work diligently to provide Canon customers with products and services of the highest quality to support their Linux and UNIX initiatives.”BrightQ™, in addition to providing Linux and Unix printing to Canon’s imageRUNNER line, will also provide a turnkey print driver interface, support for industry standard printing protocols, and a queuing system that is simple, intuitive, and cohesive across Unix operating systems and Linux distributions. Other key components of BrightQ™ include Codehost’s BrightInstall, an installation tool that enables systems support personnel to easily install, configure, and support their Unix/Linux customer base, BrightQ™ configuration tool, and the BrightQ™ Print Job Manager.  BrightQ™ offers support for most major UNIX operating systems and Linux distributions.The BrightQ drivers for specific models of Canon’s imageRUNNER, CLC, and wide format printer lines are immediately available for free download from a special Web site developed by Canon U.S.A. and Codehost at canon.codehost.com.About Codehost Inc.Founded in 1999, Codehost has emerged as the leader in Linux and UNIX software development for leading manufacturers of printers and multi-function devices. With an expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.BrightQ™ was chosen as a finalist for the Best Desktop Office Solution award during the LinuxWorld 2002 in San Francisco. You can learn more about BrightQ™ and additional Codehost products and services by visiting www.codehost.com.About Canon U.S.A., Inc.Canon U.S.A., Inc. delivers consumer, business-to-business, and industrial imaging solutions. The Company is listed as one of Fortune’s Most Admired Companies in America, and is ranked #41 on the BusinessWeek list of “Top 100 Brands.” Its parent company Canon Inc. (NYSE:CAJ) is a top patent-holder of technology, ranking second overall in the U.S. in 2002, with global revenues of $24.5 billion.  Canon U.S.A. employs approximately 11,000 people at over 30 locations.For more information, visit www.usa.canon.com.",
            "content_html": "<h2 id=\"canon-usa-and-codehost-announce-full-feature-linux-and-unix-printing-for-imagerunner-clc-and-wide-format-devices\">CANON U.S.A. AND CODEHOST ANNOUNCE FULL FEATURE LINUX AND UNIX PRINTING FOR imageRUNNER, CLC, AND WIDE FORMAT DEVICES</h2><p><b>LAKE SUCCESS, NY and CULVER CITY, CA - April 21, 2003 — </b>Canon U.S.A., Inc., a subsidiary of Canon Inc. (NYSE: CAJ), and industry leader in networked imaging solutions, and Codehost Inc., a leading provider of software solutions for manufacturers within the printing and imaging markets, today announced the availability of Codehost’s BrightQ™ suite of Linux and Unix-based printing tools for use with specific models of Canon’s imageRUNNER line of multi-function devices, CLC Color Laser Copier/Printers, and wide format printers.</p><p>BrightQ supplies systems administrators, IT and OEM support personnel, and anyone who prints via Linux and Unix with an easy-to-use, graphically-rich, printing environment, and easy-to-configure and support service protocol suite.  The turnkey package allows end users to take full advantage of available Canon imageRUNNER advanced finishing capabilities, such as single and multi-position stapling, automatic 2/3 hole punching and saddle-stitch booklet making, and support for Z-folding and document insertion via additional accessories, while still capitalizing on the strengths of their Linux and Unix applications.  Canon CLC devices and BJ-W9000 wide format printer will now also be able to print on Linux and Unix.</p><p>“Canon U.S.A. is very pleased to be the first to market with BrightQ, which helps strengthen the range of operating systems that our highly successful imageRUNNER, CLC, and wide format lines can print through,” said Dennis Amorosano, director and assistant general manager of Canon U.S.A.’s Integrated Business Systems Division.  “The intuitive BrightQ interface, coupled with Canon’s industry leading document handling and finishing capabilities, significantly advances the printing power available to Linux and Unix users, thereby more effectively supporting their application requirements.”</p><p>“Codehost is excited about the launch and the future of this product within the Canon’s product lines,” said President and CEO of Codehost, Sam Bizri. “We will continue to work diligently to provide Canon customers with products and services of the highest quality to support their Linux and UNIX initiatives.”</p><p>BrightQ™, in addition to providing Linux and Unix printing to Canon’s imageRUNNER line, will also provide a turnkey print driver interface, support for industry standard printing protocols, and a queuing system that is simple, intuitive, and cohesive across Unix operating systems and Linux distributions. Other key components of BrightQ™ include Codehost’s BrightInstall, an installation tool that enables systems support personnel to easily install, configure, and support their Unix/Linux customer base, BrightQ™ configuration tool, and the BrightQ™ Print Job Manager.  BrightQ™ offers support for most major UNIX operating systems and Linux distributions.</p><p>The BrightQ drivers for specific models of Canon’s imageRUNNER, CLC, and wide format printer lines are immediately available for free download from a special Web site developed by Canon U.S.A. and Codehost at <a href=\"http://canon.codehost.com\">canon.codehost.com</a>.</p><h3 id=\"about-codehost-inc\">About Codehost Inc.</h3><p>Founded in 1999, Codehost has emerged as the leader in Linux and UNIX software development for leading manufacturers of printers and multi-function devices. With an expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.</p><p>BrightQ™ was chosen as a finalist for the Best Desktop Office Solution award during the LinuxWorld 2002 in San Francisco. You can learn more about BrightQ™ and additional Codehost products and services by visiting <a href=\"https://www.codehost.com\">www.codehost.com</a>.</p><h3 id=\"about-canon-usa-inc\">About Canon U.S.A., Inc.</h3><p>Canon U.S.A., Inc. delivers consumer, business-to-business, and industrial imaging solutions. The Company is listed as one of Fortune’s Most Admired Companies in America, and is ranked #41 on the BusinessWeek list of “Top 100 Brands.” Its parent company Canon Inc. (NYSE:CAJ) is a top patent-holder of technology, ranking second overall in the U.S. in 2002, with global revenues of $24.5 billion.  Canon U.S.A. employs approximately 11,000 people at over 30 locations.</p><p>For more information, visit <a href=\"http://www.usa.canon.com\">www.usa.canon.com</a>.</p>",
            "url": "https://www.codehost.com/news/2003/04/brightq-available-for-canon-devices.html",
            
            
            
            
            
            "date_published": "2003-04-21T00:00:00-07:00",
            "date_modified": "2003-04-21T00:00:00-07:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2003/04/kyocera-mita-partners-with-codehost.html",
            "title": "Kyocera Mita Partners With Codehost",
            
            "content_text": "Codehost’s BrightQ Printing Tools available for Kyocera Mita Printers and Multi-Functional Products (MFPs)Fairfield, New Jersey and Culver City, California - April 8, 2003 — Kyocera Mita, one of the world’s leading document imaging companies, and Codehost, Inc., a leading provider of software solutions for original equipment manufacturers within the printing and imaging markets, today announced a strategic alliance to distribute BrightQ software through dealers/resellers to customers who currently utilize a Linux or Unix environment for their printing projects.  BrightQ’s suite of Linux and Unix printing utilities has demonstrated perfect interoperability with Kyocera Mita’s ECOSYS printers and multi-functional products (MFPs).“Kyocera Mita is pleased to announce this strategic partnership with Codehost and its BrightQ printing application,” said Michael Pietrunti, vice president, marketing for Kyocera Mita.  “BrightQ is easy to setup and provides Kyocera Mita customers with a user friendly interface.  In addition, by partnering with Codehost, we’re not only extending our reach into the Linux and Unix printer market, but we’re also providing our dealer and reseller channels with additional value when selling the devices.”Developed for Unix and Linux operating systems, BrightQ™ gives administrators and users an easy-to-use printing environment. Not only does BrightQ™ provide a simple, graphical printing environment, but also allows users to take advantage of the full functionality of their high-end printers.  BrightQ™ is geared specifically to provide original equipment manufacturers and value added resellers with a solution that provides their Unix and Linux customers with a highly intuitive and robust printing solution.  This dynamic printing suite is customizable for nearly any line of consumer, industrial or back-office printer.Commenting on Kyocera Mita printers and its advantages, Till Kamppeter, Maintainer of Linuxprinting.org said, “I recommend Kyocera Mita’s printers because they offer several advantages, including the permanent drum unit. With the permanent drum unit in all Kyocera Mita laser printers the user just needs to replace the toner and not the drum and toner together which reduces the per-page costs substantially. In addition, Kyocera Mita has cooperated nicely with the free software community, and so their printers work perfectly with Linux and Unix.”ABOUT CODEHOST, INC.Founded in 1999, Codehost has emerged as the leader in Linux and UNIX software development for leading manufacturers of printers and multi-function devices.  With an expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.   BrightQ™ was chosen as a finalist for the Best Desktop Office Solution award during the LinuxWorld 2002 in San Francisco.You can learn more about BrightQ™ and Codehost by visiting www.codehost.com.ABOUT KYOCERA MITAKyocera Mita is one of the world’s largest manufacturers and leading providers of computer-connectable peripherals, including network-ready digital copiers/printers, laser printers, color copiers/printers, digital laser facsimiles, multi-functional, and wide format imaging solutions.  Kyocera Mita is part of Kyocera Corporation, the world’s leading developer and manufacturer of advanced ceramics and associated products, including telecommunications equipment, semiconductor packages, and electronic components.  Kyocera Corporation’s consolidated net revenues totaled $9 billion during the year ended March 31, 2002.  Kyocera Mita’s headquarters for the Americas are in Fairfield, New Jersey.For more information, visit www.kyoceramita.com.For more information, please contact:Dan Butler, Public Relations Manager  Kyocera Mita America, Inc.  Tel:  973-882-4480  E-mail:  daniel_butler@kyoceramita.comKurt Rossler, Senior Account Executive  M Booth &amp; Associates for Kyocera Mita America  Tel:  212-481-7000  E-mail:  kurtr@mbooth.com",
            "content_html": "<h2 id=\"codehosts-brightq-printing-tools-available-for-kyocera-mita-printers-and-multi-functional-products-mfps\">Codehost’s BrightQ Printing Tools available for Kyocera Mita Printers and Multi-Functional Products (MFPs)</h2><p><b>Fairfield, New Jersey and Culver City, California - April 8, 2003 —</b> Kyocera Mita, one of the world’s leading document imaging companies, and Codehost, Inc., a leading provider of software solutions for original equipment manufacturers within the printing and imaging markets, today announced a strategic alliance to distribute BrightQ software through dealers/resellers to customers who currently utilize a Linux or Unix environment for their printing projects.  BrightQ’s suite of Linux and Unix printing utilities has demonstrated perfect interoperability with Kyocera Mita’s ECOSYS printers and multi-functional products (MFPs).</p><p>“Kyocera Mita is pleased to announce this strategic partnership with Codehost and its BrightQ printing application,” said Michael Pietrunti, vice president, marketing for Kyocera Mita.  “BrightQ is easy to setup and provides Kyocera Mita customers with a user friendly interface.  In addition, by partnering with Codehost, we’re not only extending our reach into the Linux and Unix printer market, but we’re also providing our dealer and reseller channels with additional value when selling the devices.”</p><p>Developed for Unix and Linux operating systems, BrightQ™ gives administrators and users an easy-to-use printing environment. Not only does BrightQ™ provide a simple, graphical printing environment, but also allows users to take advantage of the full functionality of their high-end printers.  BrightQ™ is geared specifically to provide original equipment manufacturers and value added resellers with a solution that provides their Unix and Linux customers with a highly intuitive and robust printing solution.  This dynamic printing suite is customizable for nearly any line of consumer, industrial or back-office printer.</p><p>Commenting on Kyocera Mita printers and its advantages, Till Kamppeter, Maintainer of Linuxprinting.org said, “I recommend Kyocera Mita’s printers because they offer several advantages, including the permanent drum unit. With the permanent drum unit in all Kyocera Mita laser printers the user just needs to replace the toner and not the drum and toner together which reduces the per-page costs substantially. In addition, Kyocera Mita has cooperated nicely with the free software community, and so their printers work perfectly with Linux and Unix.”</p><h3 id=\"about-codehost-inc\">ABOUT CODEHOST, INC.</h3><p>Founded in 1999, Codehost has emerged as the leader in Linux and UNIX software development for leading manufacturers of printers and multi-function devices.  With an expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.   BrightQ™ was chosen as a finalist for the Best Desktop Office Solution award during the LinuxWorld 2002 in San Francisco.</p><p>You can learn more about BrightQ™ and Codehost by visiting <a href=\"https://www.codehost.com\">www.codehost.com</a>.</p><h3 id=\"about-kyocera-mita\">ABOUT KYOCERA MITA</h3><p>Kyocera Mita is one of the world’s largest manufacturers and leading providers of computer-connectable peripherals, including network-ready digital copiers/printers, laser printers, color copiers/printers, digital laser facsimiles, multi-functional, and wide format imaging solutions.  Kyocera Mita is part of Kyocera Corporation, the world’s leading developer and manufacturer of advanced ceramics and associated products, including telecommunications equipment, semiconductor packages, and electronic components.  Kyocera Corporation’s consolidated net revenues totaled $9 billion during the year ended March 31, 2002.  Kyocera Mita’s headquarters for the Americas are in Fairfield, New Jersey.</p><p>For more information, visit <a href=\"www.kyoceramita.com\">www.kyoceramita.com</a>.</p><p>For more information, please contact:</p><p>Dan Butler, Public Relations Manager</p><ul>  <li>Kyocera Mita America, Inc.</li>  <li>Tel:  973-882-4480</li>  <li>E-mail:  <a href=\"daniel_butler@kyoceramita.com\">daniel_butler@kyoceramita.com</a></li></ul><p>Kurt Rossler, Senior Account Executive</p><ul>  <li>M Booth &amp; Associates for Kyocera Mita America</li>  <li>Tel:  212-481-7000</li>  <li>E-mail:  <a href=\"kurtr@mbooth.com\">kurtr@mbooth.com</a></li></ul>",
            "url": "https://www.codehost.com/news/2003/04/kyocera-mita-partners-with-codehost.html",
            
            
            
            
            
            "date_published": "2003-04-08T00:00:00-07:00",
            "date_modified": "2003-04-08T00:00:00-07:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2003/03/codehost-and-hitachi-announce-partnership.html",
            "title": "Codehost and Hitachi Announce Partnership",
            
            "content_text": "Hitachi and Codehost Inc., combine efforts for development of handwriting recognition software for Hitachi’s VisionPlate™ Linux-based Wireless TabletSANTA CLARA, CA and CULVER CITY, CA February, 2003 — The Hitachi Internet Platform Business Unit, a part of Hitachi, Ltd. (NYSE: HIT) and Linux software developer Codehost, Inc. today announced a software development agreement for wireless tablets running the Linux operating system. Codehost has developed a handwriting recognition interface for the Linux version of the Hitachi VisionPlate™ Wireless Tablet, providing industries that require mobile computing a low-cost alternative.“We are very pleased to be Hitachi Internet Platform Business Unit’s software development partner”, said Codehost CEO Sam Bizri. “With our experience in Linux software development, we feel Codehost can be an instrumental partner in developing applications for a number of vertical markets that improve efficiency of data collection and processing without affecting the human interaction, in this case the doctor-patient relationship.”“We are pleased to be working with Codehost,” stated Shigemi Adachi, general manager of the Hitachi Internet Platform Business Unit. “Codehost’s software expertise in combination with Hitachi’s experience in wireless products and solutions will provide exciting out-of-the box solutions for our customers.”This initiative will be focused on industries such as healthcare, allowing physicians to capture, store and document clinical data at the point of care. The graphical interface will include a handwriting recognition engine, and will be integrated with solutions developed by ReCare, the leader in wireless physician-centric charting systems. The Linux-based VisionPlate™ Wireless Tablet gives IT departments in healthcare facilities and hospitals a low cost, full-featured solution allowing healthcare providers to capture notation in the form of digital ink. The handwriting recognition interface provides physicians the flexibility and intuitiveness of a memo pad in an electronic medical record, and offers time savings through real-time transcription and transcription approval.About HitachiHitachi’s Internet Platform Business Unit provides state of the art wireless solutions in many of today’s vertical markets, such as: healthcare, hospitality, education, insurance, real estate, heavy manufacturing, retail, transportation, and government. The flagship solution, the VisionPlate™, is a powerful, practical, expandable, flexible and intrinsically safe wireless tablet PC that enables companies to perform critical business practices such as Data Entry and Processing, Inventory and Receiving, Monitoring and Tracking, Internet, E-Mail and a host of other functions, all with the unbridled freedom necessary for today’s fast moving business environment.Hitachi, Ltd. (NYSE: HIT), headquartered in Tokyo, Japan, is a leading global electronics company, with approximately 320,000 employees worldwide. Fiscal 2001 (ended March 31, 2002) consolidated sales totaled 7,994 billion yen ($60.1 billion). The company offers a wide range of systems, products and services in market sectors, including information systems, electronic devices, power and industrial systems, consumer products, materials and financial services. For more information on Hitachi, please visit the company’s Web site atglobal.hitachi.com.About Codehost, Inc.Codehost is focused on developing custom applications and turnkey solutions for a variety of hardware manufacturers and Fortune 500 companies. With their expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.Codehost has emerged as a leader in key areas of Linux development. Codehost’s BrightQ™ has been adopted as the standard printing solution for UNIX and Linux by top printing manufacturers such as Ricoh Corporation and Samsung Electronics. Through their embedded Linux initiatives, Codehost offers its clients a suite of development services including application and driver development, and OS tuning.More information is available at www.codehost.com",
            "content_html": "<h2 id=\"hitachi-and-codehost-inc-combine-efforts-for-development-of-handwriting-recognition-software-for-hitachis-visionplate-linux-based-wireless-tablet\">Hitachi and Codehost Inc., combine efforts for development of handwriting recognition software for Hitachi’s VisionPlate™ Linux-based Wireless Tablet</h2><p><b>SANTA CLARA, CA and CULVER CITY, CA February, 2003</b> — The Hitachi Internet Platform Business Unit, a part of Hitachi, Ltd. (NYSE: HIT) and Linux software developer Codehost, Inc. today announced a software development agreement for wireless tablets running the Linux operating system. Codehost has developed a handwriting recognition interface for the Linux version of the Hitachi VisionPlate™ Wireless Tablet, providing industries that require mobile computing a low-cost alternative.</p><p>“We are very pleased to be Hitachi Internet Platform Business Unit’s software development partner”, said Codehost CEO Sam Bizri. “With our experience in Linux software development, we feel Codehost can be an instrumental partner in developing applications for a number of vertical markets that improve efficiency of data collection and processing without affecting the human interaction, in this case the doctor-patient relationship.”</p><p>“We are pleased to be working with Codehost,” stated Shigemi Adachi, general manager of the Hitachi Internet Platform Business Unit. “Codehost’s software expertise in combination with Hitachi’s experience in wireless products and solutions will provide exciting out-of-the box solutions for our customers.”</p><p>This initiative will be focused on industries such as healthcare, allowing physicians to capture, store and document clinical data at the point of care. The graphical interface will include a handwriting recognition engine, and will be integrated with solutions developed by ReCare, the leader in wireless physician-centric charting systems. The Linux-based VisionPlate™ Wireless Tablet gives IT departments in healthcare facilities and hospitals a low cost, full-featured solution allowing healthcare providers to capture notation in the form of digital ink. The handwriting recognition interface provides physicians the flexibility and intuitiveness of a memo pad in an electronic medical record, and offers time savings through real-time transcription and transcription approval.</p><h3 id=\"about-hitachi\">About Hitachi</h3><p>Hitachi’s Internet Platform Business Unit provides state of the art wireless solutions in many of today’s vertical markets, such as: healthcare, hospitality, education, insurance, real estate, heavy manufacturing, retail, transportation, and government. The flagship solution, the VisionPlate™, is a powerful, practical, expandable, flexible and intrinsically safe wireless tablet PC that enables companies to perform critical business practices such as Data Entry and Processing, Inventory and Receiving, Monitoring and Tracking, Internet, E-Mail and a host of other functions, all with the unbridled freedom necessary for today’s fast moving business environment.</p><p>Hitachi, Ltd. (NYSE: HIT), headquartered in Tokyo, Japan, is a leading global electronics company, with approximately 320,000 employees worldwide. Fiscal 2001 (ended March 31, 2002) consolidated sales totaled 7,994 billion yen ($60.1 billion). The company offers a wide range of systems, products and services in market sectors, including information systems, electronic devices, power and industrial systems, consumer products, materials and financial services. For more information on Hitachi, please visit the company’s Web site at<a href=\"http://global.hitachi.com.\">global.hitachi.com.</a></p><h3 id=\"about-codehost-inc\">About Codehost, Inc.</h3><p>Codehost is focused on developing custom applications and turnkey solutions for a variety of hardware manufacturers and Fortune 500 companies. With their expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.</p><p>Codehost has emerged as a leader in key areas of Linux development. Codehost’s BrightQ™ has been adopted as the standard printing solution for UNIX and Linux by top printing manufacturers such as Ricoh Corporation and Samsung Electronics. Through their embedded Linux initiatives, Codehost offers its clients a suite of development services including application and driver development, and OS tuning.</p><p>More information is available at <a href=\"https://www.codehost.com\">www.codehost.com</a></p>",
            "url": "https://www.codehost.com/news/2003/03/codehost-and-hitachi-announce-partnership.html",
            
            
            
            
            
            "date_published": "2003-03-19T00:00:00-08:00",
            "date_modified": "2003-03-19T00:00:00-08:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2003/02/codehost-secures-1-million-loc.html",
            "title": "Codehost Secures $1 Million LOC",
            
            "content_text": "Silicon Valley Bank Maintains Strong Commitment to Emerging Technology MarketplaceCULVER CITY, Calif., February 10, 2003 — Codehost, Inc., a leading provider of software solutions for OEMs within the printing and imaging markets, announced today it secured a $1 million line of credit from Silicon Valley Bank, a subsidiary of Silicon Valley Bancshares (SIVB). The credit facility will fund Codehost’s revenue and asset growth.“Our relationship with Silicon Valley Bank enables us to align our financial strength with our business objectives and service more customers,” said Sam Bizri, CEO, Codehost.  “The Bank’s deep experience with emerging technology companies allows it to anticipate our needs, even before we do. With this additional working capital we have the flexibility we need to continue to develop long-term relationships with OEMs and grow our emerging business.”Codehost’s BrightQ printing solution for Linux and UNIX is quickly becoming adopted by leading manufacturers of high-end laser printers and multi-function devices. Having established relationships with these organizations, the company will introduce new products and services to these markets throughout 2003.“Codehost has developed key relationships with multinational printing and mobile computing OEMs and is quickly becoming a leader in turnkey software solutions in the areas of Linux, Unix, and embedded software,” said Tim Bubnack of Silicon Valley Bank. “The company is well positioned for fast growth with a strong management team, unique proprietary products, and real revenue traction.  We look forward to supporting Codehost with this financing and our comprehensive suite of banking services as Codehost grows from early stage to industry leader.”About Codehost, Inc.Founded in 1999, Codehost has emerged as the leader in Linux and UNIX software development for printers and multi-function devices, providing solutions and services for top manufacturers of high-end laser printers and multi-function devices.With an expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.BrightQ™ was chosen as a finalist for the Best Desktop Office Solution award during the LinuxWorld 2002 in San Francisco. Additional information can be found at www.codehost.com. About Silicon Valley BankSilicon Valley Bank serves emerging growth and mature companies in the technology and life sciences markets, as well as other targeted industries.  Through its focus on specialized markets and extensive knowledge of the people and business issues driving them, Silicon Valley Bank provides a level of service and partnership that measurably impacts its clients’ success. Founded in 1983 and headquartered in Santa Clara, Calif., the Bank serves more than 9,500 clients across the country through 27 regional offices.  More information on the Bank can be found at www.svb.com.",
            "content_html": "<h3 id=\"silicon-valley-bank-maintains-strong-commitment-to-emerging-technology-marketplace\">Silicon Valley Bank Maintains Strong Commitment to Emerging Technology Marketplace</h3><p><b>CULVER CITY, Calif., February 10, 2003 — </b>Codehost, Inc., a leading provider of software solutions for OEMs within the printing and imaging markets, announced today it secured a $1 million line of credit from Silicon Valley Bank, a subsidiary of Silicon Valley Bancshares (SIVB). The credit facility will fund Codehost’s revenue and asset growth.</p><p>“Our relationship with Silicon Valley Bank enables us to align our financial strength with our business objectives and service more customers,” said Sam Bizri, CEO, Codehost.  “The Bank’s deep experience with emerging technology companies allows it to anticipate our needs, even before we do. With this additional working capital we have the flexibility we need to continue to develop long-term relationships with OEMs and grow our emerging business.”</p><p>Codehost’s BrightQ printing solution for Linux and UNIX is quickly becoming adopted by leading manufacturers of high-end laser printers and multi-function devices. Having established relationships with these organizations, the company will introduce new products and services to these markets throughout 2003.</p><p>“Codehost has developed key relationships with multinational printing and mobile computing OEMs and is quickly becoming a leader in turnkey software solutions in the areas of Linux, Unix, and embedded software,” said Tim Bubnack of Silicon Valley Bank. “The company is well positioned for fast growth with a strong management team, unique proprietary products, and real revenue traction.  We look forward to supporting Codehost with this financing and our comprehensive suite of banking services as Codehost grows from early stage to industry leader.”</p><h3 id=\"about-codehost-inc\">About Codehost, Inc.</h3><p>Founded in 1999, Codehost has emerged as the leader in Linux and UNIX software development for printers and multi-function devices, providing solutions and services for top manufacturers of high-end laser printers and multi-function devices.</p><p>With an expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.</p><p>BrightQ™ was chosen as a finalist for the Best Desktop Office Solution award during the LinuxWorld 2002 in San Francisco. Additional information can be found at www.codehost.com. <br /><br /></p><h3 id=\"about-silicon-valley-bank\">About Silicon Valley Bank</h3><p>Silicon Valley Bank serves emerging growth and mature companies in the technology and life sciences markets, as well as other targeted industries.  Through its focus on specialized markets and extensive knowledge of the people and business issues driving them, Silicon Valley Bank provides a level of service and partnership that measurably impacts its clients’ success. Founded in 1983 and headquartered in Santa Clara, Calif., the Bank serves more than 9,500 clients across the country through 27 regional offices.  More information on the Bank can be found at <a href=\"http://www.svb.com\">www.svb.com</a>.</p>",
            "url": "https://www.codehost.com/news/2003/02/codehost-secures-1-million-loc.html",
            
            
            
            
            
            "date_published": "2003-02-10T00:00:00-08:00",
            "date_modified": "2003-02-10T00:00:00-08:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2003/01/ricoh-to-offer-customers-brightq.html",
            "title": "Ricoh To Offer Customers BrightQ",
            
            "content_text": "Ricoh Corporation will make the BrightQ™ printing solution for UNIX and Linux available for its Aficio line of output devices.WEST CALDWELL, NJ and CULVER CITY, CA - January 22, 2003 — Ricoh Corporation, the Dependable Digital™ output company, announced today that is has aligned with UNIX and Linux software developer Codehost Inc. Ricoh will offer its customers and dealers BrightQ™, Codehost’s popular suite of Linux and UNIX-based printing tools, for use with Ricoh networked output devices.“Ricoh recognizes the important role Linux and UNIX applications play in the enterprise. Allowing IT users to share this information through print applications more efficiently is a part of Ricoh’s core strategy.  Providing productivity tools such as BrightQ enables us to provide the best possible support to our steadily increasing base of Linux and UNIX users”, said Wayne Mize, Vice President of Ricoh’s Solutions Marketing Division.BrightQ™ will be available for select models of Ricoh’s award winning Aficio line of output devices, delivering customers within the Linux and UNIX environments a robust, easy-to-use solution that provides complete access to the Aficio’s advanced document finishing features.“Codehost is very pleased to be working with Ricoh. We feel BrightQ™ offers great value to their dealers and distributors, providing them with a solution that satisfies corporate printing needs generated by the growing use of Linux and high dependency on UNIX systems,” said Codehost CEO Sam Bizri. “They can support their customers’ technology platforms with minimal effort, and increase their value proposition by providing a full suite of solutions supporting UNIX and Linux alongside Windows”.BrightQ™ is comprised of intuitive graphical interfaces that allow users to manage printers, complex print jobs and sophisticated print queues, while providing support for industry standard printing protocols. A key component of BrightQ™ is Codehost’s BrightInstall™, an installation tool that enables systems support personnel to easily install, configure, and support their UNIX/Linux customer base. BrightQ™ supports most major UNIX operating systems and Linux distributions.Beginning this week, BrightQ™ will be available for demonstration at “Ricoh’s Technology Portal” showroom in Mid-town Manhattan. The Technology Portal is located at 510 Fifth Street (at 43rd Avenue) which is approximately 1.6 miles from the Jacob K. Javits Convention Center where the 2003 LinuxWorld Conference and Expo is being held.BrightQ™ was chosen as finalist for the Best Desktop Office Solution award during the LinuxWorld 2002 in San Francisco.About Codehost Inc.Founded in 1999, Codehost has emerged as the leader in Linux and UNIX software development for printers and multi-function devices, providing solutions and services for the top manufacturers of MFDs.Codehost is focused on developing custom applications and turnkey solutions for a variety of hardware manufacturers and major corporations. With their expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.Information about BrightQ™ and Codehost’s additional products and services can be found online at www.codehost.com.About Ricoh Corporation.Ricoh Corporation, headquartered in West Caldwell, N.J., is a subsidiary of Ricoh Company Ltd., the 66-year-old leading supplier of office automation equipment and electronics, with fiscal year 2001 sales in excess of $14 billion.Ricoh Corporation is a leading provider of multifunctional document systems, including color and black &amp; white digital imaging systems, facsimile products, printers, scanners, digital duplicators and wide format engineering systems.The Company oversees Ricoh operations in North, Central and South America, including the Savin, Gestetner and Lanier brands.  For fiscal year 2001, Ricoh Corporation sales exceeded $2.7 billion.Information about Ricoh’s complete range of products and services can be accessed on the World Wide Web at www.ricoh-usa.com",
            "content_html": "<h2 id=\"ricoh-corporation-will-make-the-brightq-printing-solution-for-unix-and-linux-available-for-its-aficio-line-of-output-devices\">Ricoh Corporation will make the BrightQ™ printing solution for UNIX and Linux available for its Aficio line of output devices.</h2><p><b>WEST CALDWELL, NJ and CULVER CITY, CA - January 22, 2003</b> — Ricoh Corporation, the Dependable Digital™ output company, announced today that is has aligned with UNIX and Linux software developer Codehost Inc. Ricoh will offer its customers and dealers BrightQ™, Codehost’s popular suite of Linux and UNIX-based printing tools, for use with Ricoh networked output devices.</p><p>“Ricoh recognizes the important role Linux and UNIX applications play in the enterprise. Allowing IT users to share this information through print applications more efficiently is a part of Ricoh’s core strategy.  Providing productivity tools such as BrightQ enables us to provide the best possible support to our steadily increasing base of Linux and UNIX users”, said Wayne Mize, Vice President of Ricoh’s Solutions Marketing Division.</p><p>BrightQ™ will be available for select models of Ricoh’s award winning Aficio line of output devices, delivering customers within the Linux and UNIX environments a robust, easy-to-use solution that provides complete access to the Aficio’s advanced document finishing features.</p><p>“Codehost is very pleased to be working with Ricoh. We feel BrightQ™ offers great value to their dealers and distributors, providing them with a solution that satisfies corporate printing needs generated by the growing use of Linux and high dependency on UNIX systems,” said Codehost CEO Sam Bizri. “They can support their customers’ technology platforms with minimal effort, and increase their value proposition by providing a full suite of solutions supporting UNIX and Linux alongside Windows”.</p><p>BrightQ™ is comprised of intuitive graphical interfaces that allow users to manage printers, complex print jobs and sophisticated print queues, while providing support for industry standard printing protocols. A key component of BrightQ™ is Codehost’s BrightInstall™, an installation tool that enables systems support personnel to easily install, configure, and support their UNIX/Linux customer base. BrightQ™ supports most major UNIX operating systems and Linux distributions.</p><p>Beginning this week, BrightQ™ will be available for demonstration at “Ricoh’s Technology Portal” showroom in Mid-town Manhattan. The Technology Portal is located at 510 Fifth Street (at 43rd Avenue) which is approximately 1.6 miles from the Jacob K. Javits Convention Center where the 2003 LinuxWorld Conference and Expo is being held.</p><p>BrightQ™ was chosen as finalist for the Best Desktop Office Solution award during the LinuxWorld 2002 in San Francisco.</p><h3 id=\"about-codehost-inc\">About Codehost Inc.</h3><p>Founded in 1999, Codehost has emerged as the leader in Linux and UNIX software development for printers and multi-function devices, providing solutions and services for the top manufacturers of MFDs.</p><p>Codehost is focused on developing custom applications and turnkey solutions for a variety of hardware manufacturers and major corporations. With their expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.</p><p>Information about BrightQ™ and Codehost’s additional products and services can be found online at <a href=\"https://www.codehost.com\">www.codehost.com</a>.</p><h3 id=\"about-ricoh-corporation\">About Ricoh Corporation.</h3><p>Ricoh Corporation, headquartered in West Caldwell, N.J., is a subsidiary of Ricoh Company Ltd., the 66-year-old leading supplier of office automation equipment and electronics, with fiscal year 2001 sales in excess of $14 billion.</p><p>Ricoh Corporation is a leading provider of multifunctional document systems, including color and black &amp; white digital imaging systems, facsimile products, printers, scanners, digital duplicators and wide format engineering systems.</p><p>The Company oversees Ricoh operations in North, Central and South America, including the Savin, Gestetner and Lanier brands.  For fiscal year 2001, Ricoh Corporation sales exceeded $2.7 billion.</p><p>Information about Ricoh’s complete range of products and services can be accessed on the World Wide Web at <a href=\"http://www.ricoh-usa.com\">www.ricoh-usa.com</a></p>",
            "url": "https://www.codehost.com/news/2003/01/ricoh-to-offer-customers-brightq.html",
            
            
            
            
            
            "date_published": "2003-01-22T00:00:00-08:00",
            "date_modified": "2003-01-22T00:00:00-08:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2003/01/codehost-licenses-cups-from-easysw.html",
            "title": "Codehost Licenses CUPS From EasySW",
            
            "content_text": "Codehost to include portions of CUPS source for use with BrightQ™ Printing SuiteCULVER CITY, CA and HOLLYWOOD, MD - January 16, 2003 — Software developers Codehost, Inc. and Easy Software Products announced today that the two companies have entered into a licensing agreement that will allow Codehost to utilize aspects of the Common UNIX Printing System (CUPS) source code. The CUPS source code will be used within BrightQ™, Codehost’s popular turnkey printing suite for corporate UNIX and Linux users of multi-function devices and high-end printers.“With the inclusion of CUPS source code, Codehost is capitalizing on what is emerging as an industry standard in Linux and UNIX print systems.   While we have included some CUPS code in our product, BrightQ™ still retains its ability to function with or without CUPS acting as the default print system,” said Eric Levy, Codehost’s General Manager of printing systems.Codehost has merged components of the CUPS technology with the advanced installation, print queue management, and sophisticated vendor centric filters, and parsers of the BrightQ™ printing suite. This allows Codehost to further protect its OEM partner’s investments while increasing the scalability and interoperability of BrightQ™.“Having access to the Easy Software development team’s deep knowledge of UNIX and Linux printing allows us to grow to meet both technical and market demands,” said Codehost CEO Sam Bizri. “In the long term, this relationship will enable us to channel the appropriate resources as we extend our products and services to include undeveloped and untapped areas of corporate printing and imaging solutions.”About Codehost Inc.Founded in 1999, Codehost has emerged as the leader in Linux and UNIX software development for printers and multi-function devices, providing solutions and services for top manufacturers such as Canon U.S.A and Samsung Electronics.With an expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.BrightQ™ was chosen as a finalist for the Best Desktop Office Solution award during the LinuxWorld 2002 in San Francisco.",
            "content_html": "<h2 id=\"codehost-to-include-portions-of-cups-source-for-use-with-brightq-printing-suite\">Codehost to include portions of CUPS source for use with BrightQ™ Printing Suite</h2><p><b>CULVER CITY, CA and HOLLYWOOD, MD - January 16, 2003 </b>— Software developers Codehost, Inc. and Easy Software Products announced today that the two companies have entered into a licensing agreement that will allow Codehost to utilize aspects of the Common UNIX Printing System (CUPS) source code. The CUPS source code will be used within BrightQ™, Codehost’s popular turnkey printing suite for corporate UNIX and Linux users of multi-function devices and high-end printers.</p><p>“With the inclusion of CUPS source code, Codehost is capitalizing on what is emerging as an industry standard in Linux and UNIX print systems.   While we have included some CUPS code in our product, BrightQ™ still retains its ability to function with or without CUPS acting as the default print system,” said Eric Levy, Codehost’s General Manager of printing systems.</p><p>Codehost has merged components of the CUPS technology with the advanced installation, print queue management, and sophisticated vendor centric filters, and parsers of the BrightQ™ printing suite. This allows Codehost to further protect its OEM partner’s investments while increasing the scalability and interoperability of BrightQ™.</p><p>“Having access to the Easy Software development team’s deep knowledge of UNIX and Linux printing allows us to grow to meet both technical and market demands,” said Codehost CEO Sam Bizri. “In the long term, this relationship will enable us to channel the appropriate resources as we extend our products and services to include undeveloped and untapped areas of corporate printing and imaging solutions.”</p><h3 id=\"about-codehost-inc\">About Codehost Inc.</h3><p>Founded in 1999, Codehost has emerged as the leader in Linux and UNIX software development for printers and multi-function devices, providing solutions and services for top manufacturers such as Canon U.S.A and Samsung Electronics.</p><p>With an expertise in a number of operating system platforms, hardware architectures, embedded technologies and peripheral devices, Codehost strives to establish long-term relationships with OEMs to support and grow their market share, while helping them enter emerging market segments.</p><p>BrightQ™ was chosen as a finalist for the Best Desktop Office Solution award during the LinuxWorld 2002 in San Francisco.</p>",
            "url": "https://www.codehost.com/news/2003/01/codehost-licenses-cups-from-easysw.html",
            
            
            
            
            
            "date_published": "2003-01-15T00:00:00-08:00",
            "date_modified": "2003-01-15T00:00:00-08:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2003/01/montavista-reveals-linux-strategy.html",
            "title": "MontaVista Reveals Linux Strategy",
            
            "content_text": "Specialized Product and Broad Partner Ecosystem Enables Custom Device SolutionsLAS VEGAS, NV. - Jan. 8, 2003 — MontaVista Software Inc., the company powering the embedded revolution, today announced a new push into the consumer electronics market with the introduction of the MontaVista™ Linux Consumer Electronics Edition 3.0, and the unveiling of an extensive ecosystem of strategic semiconductor, software application and middleware partners for complementary device solutions. This push represents a new aggressive strategy that will offer software developers a rich development environment especially optimized for Consumer Electronics. The company will also make available its rich Java development environment and state-of-the-art graphics tools to complete its strategic focus on meeting the needs of the Consumer Electronics market.“Consumer electronics products are evolving from simple, single function appliances into complex, network-connected devices,” said Stephen Balacco, embedded systems analyst at Venture Development Corporation. “The expanded functionality of these products will increasingly require high performance hardware and a 32-bit robust multitasking operating system, such as Linux. Companies developing new consumer devices will benefit from MontaVista Linux Consumer Electronics Edition and the extensive MontaVista partner ecosystem inhabited by companies providing complementary components and solutions for next-generation consumer electronics products.”As part of its comprehensive consumer electronics strategy, MontaVista today announced MontaVista™ Linux Consumer Electronics Edition 3.0 (CEE) – the first Linux operating system and cross-development environment specifically designed for consumer electronics applications. This new product – also part of the well known MontaVista Linux family of products – enhances Linux with dynamic power management, rich consumer-focused networking support and consumer-grade reliability.MontaVista Software is demonstrating a range of cutting-edge consumer products built on MontaVista Linux, from the world’s leading Consumer Electronics companies in booth # 35179, in the Embedded Technologies Pavilion at the International Consumer Electronics Show, Jan 9-12, 2003 in the Las Vegas Convention Center.Broad and Robust Ecosystem MontaVista Software is partnering with a broad array of semiconductor, software application, middleware, and systems integration companies to provide solutions for device manufacturers in key markets including mobile and wireless, television and home entertainment, and automotive telematics.For example, CEE will initially support the TI’s OMAP1510 and OMAP5910 processors and the IBM PowerPC 405LP processor with support for additional processing platforms to be added in the future. In addition, CEE will provide the foundation of solution stacks from software partners in key consumer electronics markets. The MontaVista Partner program already includes companies such as:  Access, Opera Software, Espial, Phoenix Technologies, Websoft  International and Zentek for device web browsers  BMR and MasterIA for Chinese fonts and input  Codehost with rich printing support  Hughes Software Systems for VoIP and SIP stacks  IBM for end-to-end device management and enterprise connectivity  InterVideo for Linux-based DVD playing software  IP Infusion for routing protocol stacks  Liberate for Digital TV middleware  Macrovision for digital rights and license management  MasterIA for Korean fonts and input  Movial for rich embedded Instant Communication software  Omron Software for Japanese input  Open Interface for certified Bluetooth stacks  ProSyst for its open and scalable service delivery platform  Solid Information Technology and PointBase for embedded databases  Tao Group for multimedia enginesDozens of additional partnerships will be announced over the coming months that will enrich the ecosystem and continue to allow developers to choose from a wide array of components that have been validated with MontaVista Linux.“These extensive collaborative efforts offer OEMs complete hardware software solutions, which will both speed time-to-market and lower total development costs for the next generation of consumer and home electronics devices,” said Sheila Baker, vice president, Marketing, MontaVista Software. “These partnerships will help consumer electronics companies leverage a wealth of applications and meet the high productivity and low power requirements of new consumer devices with more complex functionality.”More than 100 consumer electronics device companies are already using MontaVista Linux, developing products as varied as cell phones, PDAs, set-top boxes, Internet radios, residential gateways, automotive telematics and Karaoke machines. MontaVista Software’s current consumer electronics customer list includes Sony, Panasonic (Matsushita), NEC, and Toshiba America. Companies like Holland-based Zintec Holding and Araneo in Israel have also chosen MontaVista Linux for their digital television market products.Important Consumer Electronics Developer Needs - Java and GraphicsTo address the growing demand for embedded Java, MontaVista Software offers a Java runtime environment that addresses the needs of today’s embedded applications. MontaVista provides a complete embedded Java developer’s package fully certified to the J2ME standard across all architectures supported by MontaVista Linux, delivering industry-leading features and performance to meet the requirements for Java enabled embedded systems. The single Java implementation delivered by MontaVista Software is based on the well-known WebSphere Studio products from IBM.Designing graphics for the variety of embedded devices requires powerful tools, flexible graphics functionality and close integration with the architecture and platform being used. To address the growing demand by developers of consumer devices, MontaVista delivers a full graphics environment with state-of-the-art graphics tools and libraries to enable developers to create graphics solutions for a wide variety of products. Built with the best open source technology available today, MontaVista Graphics combines a diverse set of components into a single, fully tested and supported graphics development toolkit. MontaVista Software also offers Qt/Embedded built, tested and supported specifically for MontaVista Linux Professional Edition. Based on the popular Qt API Qt/Embedded provides a small-footprint implementation designed to meet the needs of the next generation of consumer devices.About MontaVista SoftwareMontaVista Software is a leading global supplier of systems software for intelligent connected devices and associated infrastructure. MontaVista powers the embedded revolution by providing GNU/Linux-based open-source software solutions. Founded in 1999 by real-time operating system (RTOS) pioneer James Ready, MontaVista offers a family of products under the MontaVista Linux umbrella that address broad-based software developer needs encompassing applications ranging from communications infrastructure to consumer electronics. Multiple Editions of MontaVista Linux are available – including Professional, Consumer Electronics and Carrier Grade – along with complementary technology products providing powerful Java and graphics development capabilities.Headquartered in the heart of Silicon Valley, in Sunnyvale, Calif., MontaVista Software is a privately held company funded by leading investors such as Alloy Ventures, US Venture Partners, RRE Ventures, WR Hambrecht + Co., IBM, Intel Capital, Sony, Panasonic (Matsushita), Toshiba America and Yamaha Corporation. For more information about MontaVista Software, please visit www.mvista.com.",
            "content_html": "<h2 id=\"specialized-product-and-broad-partner-ecosystem-enables-custom-device-solutions\">Specialized Product and Broad Partner Ecosystem Enables Custom Device Solutions</h2><p><b>LAS VEGAS, NV. - Jan. 8, 2003 </b>— MontaVista Software Inc., the company powering the embedded revolution, today announced a new push into the consumer electronics market with the introduction of the MontaVista™ Linux Consumer Electronics Edition 3.0, and the unveiling of an extensive ecosystem of strategic semiconductor, software application and middleware partners for complementary device solutions. This push represents a new aggressive strategy that will offer software developers a rich development environment especially optimized for Consumer Electronics. The company will also make available its rich Java development environment and state-of-the-art graphics tools to complete its strategic focus on meeting the needs of the Consumer Electronics market.</p><p>“Consumer electronics products are evolving from simple, single function appliances into complex, network-connected devices,” said Stephen Balacco, embedded systems analyst at Venture Development Corporation. “The expanded functionality of these products will increasingly require high performance hardware and a 32-bit robust multitasking operating system, such as Linux. Companies developing new consumer devices will benefit from MontaVista Linux Consumer Electronics Edition and the extensive MontaVista partner ecosystem inhabited by companies providing complementary components and solutions for next-generation consumer electronics products.”</p><p>As part of its comprehensive consumer electronics strategy, MontaVista today announced MontaVista™ Linux Consumer Electronics Edition 3.0 (CEE) – the first Linux operating system and cross-development environment specifically designed for consumer electronics applications. This new product – also part of the well known MontaVista Linux family of products – enhances Linux with dynamic power management, rich consumer-focused networking support and consumer-grade reliability.</p><p>MontaVista Software is demonstrating a range of cutting-edge consumer products built on MontaVista Linux, from the world’s leading Consumer Electronics companies in booth # 35179, in the Embedded Technologies Pavilion at the International Consumer Electronics Show, Jan 9-12, 2003 in the Las Vegas Convention Center.</p><p><b>Broad and Robust Ecosystem </b><br />MontaVista Software is partnering with a broad array of semiconductor, software application, middleware, and systems integration companies to provide solutions for device manufacturers in key markets including mobile and wireless, television and home entertainment, and automotive telematics.</p><p>For example, CEE will initially support the TI’s OMAP1510 and OMAP5910 processors and the IBM PowerPC 405LP processor with support for additional processing platforms to be added in the future. In addition, CEE will provide the foundation of solution stacks from software partners in key consumer electronics markets. The MontaVista Partner program already includes companies such as:</p><ul>  <li>Access, Opera Software, Espial, Phoenix Technologies, Websoft</li>  <li>International and Zentek for device web browsers</li>  <li>BMR and MasterIA for Chinese fonts and input</li>  <li>Codehost with rich printing support</li>  <li>Hughes Software Systems for VoIP and SIP stacks</li>  <li>IBM for end-to-end device management and enterprise connectivity</li>  <li>InterVideo for Linux-based DVD playing software</li>  <li>IP Infusion for routing protocol stacks</li>  <li>Liberate for Digital TV middleware</li>  <li>Macrovision for digital rights and license management</li>  <li>MasterIA for Korean fonts and input</li>  <li>Movial for rich embedded Instant Communication software</li>  <li>Omron Software for Japanese input</li>  <li>Open Interface for certified Bluetooth stacks</li>  <li>ProSyst for its open and scalable service delivery platform</li>  <li>Solid Information Technology and PointBase for embedded databases</li>  <li>Tao Group for multimedia engines</li></ul><p>Dozens of additional partnerships will be announced over the coming months that will enrich the ecosystem and continue to allow developers to choose from a wide array of components that have been validated with MontaVista Linux.</p><p>“These extensive collaborative efforts offer OEMs complete hardware software solutions, which will both speed time-to-market and lower total development costs for the next generation of consumer and home electronics devices,” said Sheila Baker, vice president, Marketing, MontaVista Software. “These partnerships will help consumer electronics companies leverage a wealth of applications and meet the high productivity and low power requirements of new consumer devices with more complex functionality.”</p><p>More than 100 consumer electronics device companies are already using MontaVista Linux, developing products as varied as cell phones, PDAs, set-top boxes, Internet radios, residential gateways, automotive telematics and Karaoke machines. MontaVista Software’s current consumer electronics customer list includes Sony, Panasonic (Matsushita), NEC, and Toshiba America. Companies like Holland-based Zintec Holding and Araneo in Israel have also chosen MontaVista Linux for their digital television market products.</p><h3 id=\"important-consumer-electronics-developer-needs---java-and-graphics\">Important Consumer Electronics Developer Needs - Java and Graphics</h3><p>To address the growing demand for embedded Java, MontaVista Software offers a Java runtime environment that addresses the needs of today’s embedded applications. MontaVista provides a complete embedded Java developer’s package fully certified to the J2ME standard across all architectures supported by MontaVista Linux, delivering industry-leading features and performance to meet the requirements for Java enabled embedded systems. The single Java implementation delivered by MontaVista Software is based on the well-known WebSphere Studio products from IBM.</p><p>Designing graphics for the variety of embedded devices requires powerful tools, flexible graphics functionality and close integration with the architecture and platform being used. To address the growing demand by developers of consumer devices, MontaVista delivers a full graphics environment with state-of-the-art graphics tools and libraries to enable developers to create graphics solutions for a wide variety of products. Built with the best open source technology available today, MontaVista Graphics combines a diverse set of components into a single, fully tested and supported graphics development toolkit. MontaVista Software also offers Qt/Embedded built, tested and supported specifically for MontaVista Linux Professional Edition. Based on the popular Qt API Qt/Embedded provides a small-footprint implementation designed to meet the needs of the next generation of consumer devices.</p><h3 id=\"about-montavista-software\">About MontaVista Software</h3><p>MontaVista Software is a leading global supplier of systems software for intelligent connected devices and associated infrastructure. MontaVista powers the embedded revolution by providing GNU/Linux-based open-source software solutions. Founded in 1999 by real-time operating system (RTOS) pioneer James Ready, MontaVista offers a family of products under the MontaVista Linux umbrella that address broad-based software developer needs encompassing applications ranging from communications infrastructure to consumer electronics. Multiple Editions of MontaVista Linux are available – including Professional, Consumer Electronics and Carrier Grade – along with complementary technology products providing powerful Java and graphics development capabilities.</p><p>Headquartered in the heart of Silicon Valley, in Sunnyvale, Calif., MontaVista Software is a privately held company funded by leading investors such as Alloy Ventures, US Venture Partners, RRE Ventures, WR Hambrecht + Co., IBM, Intel Capital, Sony, Panasonic (Matsushita), Toshiba America and Yamaha Corporation. For more information about MontaVista Software, please visit <a href=\"http://www.mvista.com\">www.mvista.com</a>.</p>",
            "url": "https://www.codehost.com/news/2003/01/montavista-reveals-linux-strategy.html",
            
            
            
            
            
            "date_published": "2003-01-08T00:00:00-08:00",
            "date_modified": "2003-01-08T00:00:00-08:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2002/08/canon-and-codehost-announce-partnership.html",
            "title": "Canon And Codehost Announce Partnership",
            
            "content_text": "CANON U.S.A. AND CODEHOST INC. ANNOUNCE DEVELOPMENT AGREEMENT TO OFFER BRIGHTQ FOR THE imageRUNNERLAKE SUCCESS, NY and CULVER CITY, CA - August 13, 2002 — Canon U.S.A., Inc., a subsidiary of Canon Inc. (NYSE: CAJ), and industry leader in networked imaging solutions, and Codehost Inc., a leader in Linux and Unix software applications, today announced a development agreement where Codehost will supply its BrightQ™ suite of Linux and Unix-based printing tools for use with Canon’s imageRUNNER line of multi-function devices.  The two companies will demonstrate the solution this week at LinuxWorld 2002, being held in San Francisco’s Moscone Center August 13-15.“Canon U.S.A. is very pleased to announce this new development agreement with Codehost,” said Dennis Amorosano, director and assistant general manager of Canon U.S.A.’s Copier and Networked Office Systems Division.  “With BrightQ, our dealers and customers will have complete Linux and Unix print support for our popular line of imageRUNNER devices, including access to the advanced document finishing features that have clearly differentiated us from our competition.”“Canon is demonstrating that both complex printing and finishing features need not be the sole realm of Microsoft and Apple clients.  This step will enable a MFD market that up to this point has been almost completely ignored and subsequently untapped,” said Eric Levy, general manager of Print Systems at Codehost Inc. “The Linux operating system continues to make inroads into corporate infrastructure, and on the desktop. We envision this trend continuing.  The nature of not having to manage costly client OS licenses, and the ever increasing volume of available software will continue to push Linux onto the desktop, where complex printing will be the norm.”BrightQ™, in addition to providing Linux and Unix printing to Canon’s imageRUNNER line, will also provide a turnkey print driver interface, support for industry standard printing protocols, and a queuing system that is simple, intuitive, as well as cohesive across Unix operating systems and Linux distributions. Other key components of BrightQ™ include Codehost’s BrightInstall, an installation tool that enables systems support personnel to easily install, configure, and support their Unix/Linux customer base, BrightQ™ configuration tool, and the BrightQ™ Print Job Manager.  BrightQ™ offers support for most major UNIX operating systems and Linux distributions.",
            "content_html": "<h2 id=\"canon-usa-and-codehost-inc-announce-development-agreement-to-offer-brightq-for-the-imagerunner\">CANON U.S.A. AND CODEHOST INC. ANNOUNCE DEVELOPMENT AGREEMENT TO OFFER BRIGHTQ FOR THE imageRUNNER</h2><p><strong>LAKE SUCCESS, NY and CULVER CITY, CA - August 13, 2002</strong> — Canon U.S.A., Inc., a subsidiary of Canon Inc. (NYSE: CAJ), and industry leader in networked imaging solutions, and Codehost Inc., a leader in Linux and Unix software applications, today announced a development agreement where Codehost will supply its BrightQ™ suite of Linux and Unix-based printing tools for use with Canon’s imageRUNNER line of multi-function devices.  The two companies will demonstrate the solution this week at LinuxWorld 2002, being held in San Francisco’s Moscone Center August 13-15.</p><p>“Canon U.S.A. is very pleased to announce this new development agreement with Codehost,” said Dennis Amorosano, director and assistant general manager of Canon U.S.A.’s Copier and Networked Office Systems Division.  “With BrightQ, our dealers and customers will have complete Linux and Unix print support for our popular line of imageRUNNER devices, including access to the advanced document finishing features that have clearly differentiated us from our competition.”</p><p>“Canon is demonstrating that both complex printing and finishing features need not be the sole realm of Microsoft and Apple clients.  This step will enable a MFD market that up to this point has been almost completely ignored and subsequently untapped,” said Eric Levy, general manager of Print Systems at Codehost Inc. “The Linux operating system continues to make inroads into corporate infrastructure, and on the desktop. We envision this trend continuing.  The nature of not having to manage costly client OS licenses, and the ever increasing volume of available software will continue to push Linux onto the desktop, where complex printing will be the norm.”</p><p>BrightQ™, in addition to providing Linux and Unix printing to Canon’s imageRUNNER line, will also provide a turnkey print driver interface, support for industry standard printing protocols, and a queuing system that is simple, intuitive, as well as cohesive across Unix operating systems and Linux distributions. Other key components of BrightQ™ include Codehost’s BrightInstall, an installation tool that enables systems support personnel to easily install, configure, and support their Unix/Linux customer base, BrightQ™ configuration tool, and the BrightQ™ Print Job Manager.  BrightQ™ offers support for most major UNIX operating systems and Linux distributions.</p>",
            "url": "https://www.codehost.com/news/2002/08/canon-and-codehost-announce-partnership.html",
            
            
            
            
            
            "date_published": "2002-08-12T00:00:00-07:00",
            "date_modified": "2002-08-12T00:00:00-07:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2002/08/brightq-linuxworld-awards-finalist.html",
            "title": "BrightQ: LinuxWorld Awards Finalist",
            
            "content_text": "BrightQ™, developed by Codehost Inc., has been selected as one of the finalists for the Open Source Awards in the category of Best Desktop Productivity Solution at LinuxWorld 2002 in San Francisco. BrightQ™ provides the Unix and Linux environments with a unified printing interface and gives users of multi-function devices and printers full access to all finishing features.“We are excited to show the community just how thorough and simple to use this solution is,” said Bardia Mohseni, Codehost’s Printing Systems Sales Manager. “This product will make life much easier for admins and end-users within companies migrating to Linux or looking to maintain their Unix environments.”Over 60 products were nominated for this award and three were chosen as finalists. The other finalists include Sun Microsystems StarOffice and Crossover Office from CodeWeavers. The winner will be announced at LinuxWorld on Wednesday August 14th at the Moscone Center.LinuxWorld runs from August 13-15. Codehost is located in booth #1081. Exhibiting alongside Codehost will be partners including, Canon U.S.A, Canon Business Solutions, Hitachi Data Systems and Samsung Electronics.",
            "content_html": "<p>BrightQ™, developed by Codehost Inc., has been selected as one of the finalists for the Open Source Awards in the category of Best Desktop Productivity Solution at LinuxWorld 2002 in San Francisco. BrightQ™ provides the Unix and Linux environments with a unified printing interface and gives users of multi-function devices and printers full access to all finishing features.</p><p>“We are excited to show the community just how thorough and simple to use this solution is,” said Bardia Mohseni, Codehost’s Printing Systems Sales Manager. “This product will make life much easier for admins and end-users within companies migrating to Linux or looking to maintain their Unix environments.”</p><p>Over 60 products were nominated for this award and three were chosen as finalists. The other finalists include Sun Microsystems StarOffice and Crossover Office from CodeWeavers. The winner will be announced at LinuxWorld on Wednesday August 14th at the Moscone Center.</p><p>LinuxWorld runs from August 13-15. Codehost is located in booth #1081. Exhibiting alongside Codehost will be partners including, Canon U.S.A, Canon Business Solutions, Hitachi Data Systems and Samsung Electronics.</p>",
            "url": "https://www.codehost.com/news/2002/08/brightq-linuxworld-awards-finalist.html",
            
            
            
            
            
            "date_published": "2002-08-06T00:00:00-07:00",
            "date_modified": "2002-08-06T00:00:00-07:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2002/05/codehost-announces-printing-systems-gm.html",
            "title": "Codehost Announces Printing Systems GM",
            
            "content_text": "Codehost Inc. announces that Eric Jaffe Levy has been hired as thesoftware company’s General Manager of Printing Systems. He joinedCodehost in late April, shortly before the release of BrightQ™,Codehost’s Unix/Linux printing solution.Mr. Levy comes to Codehost with 11 years of experience in the printingand computing industry. Most recently Levy worked with Canon BusinessSolutions West as a Senior Network Analyst where he was responsible forall third party product analysis and acquisition.Previous to his tenure at Canon, Levy spent 2 years as the VicePresident of Client Services for Veon, Inc. a leading provider ofbroadband technology. Levy also played a critical role in the PhilipsElectronics acquisition of Veon, Inc. Prior to Veon Levy spent sixyears with Electronics for Imaging, Inc., holding several positionsalong the way including but not limited to; Program and QualityAssurance Manager, Sr. Technical Services Manager, Australia AccountManager, and European Technical Services Sr. Manager. During this timeLevy deployed and managed both EFI’s domestic and European TechnicalServices operations and oversaw all technical communications with OEM’stechnical services teams, ensuring that partner objectives wereachieved.“His real world field experience with products, vendors and OEMsinstantly provides us with the intimate market knowledge and leadershipthis position requires,” said Codehost CEO, Sam Bizri. “He is theperfect fit to help us achieve our goals.”Levy’s primary responsibilities will be to manage Codehost’s currentline of printing centric products and services, while executingCodehost’s goal of reducing the labor and complexity associated withcross-platform printing cohesiveness. Our core client side focus willcontinue to be on Unix and Linux, but the enterprise products will focuson multiple OS support and remote BrightQ™ administration.“Along with our core technology focus, we are also very excited aboutestablishing industry partnerships in order to assist the printing OEMsin entering the growing Unix and emerging Linux printing market,” saidLevy. “Not to be too cliché, but we are working to make printing muchBrighter than it currently is.”",
            "content_html": "<p>Codehost Inc. announces that Eric Jaffe Levy has been hired as thesoftware company’s General Manager of Printing Systems. He joinedCodehost in late April, shortly before the release of BrightQ™,Codehost’s Unix/Linux printing solution.</p><p>Mr. Levy comes to Codehost with 11 years of experience in the printingand computing industry. Most recently Levy worked with Canon BusinessSolutions West as a Senior Network Analyst where he was responsible forall third party product analysis and acquisition.</p><p>Previous to his tenure at Canon, Levy spent 2 years as the VicePresident of Client Services for Veon, Inc. a leading provider ofbroadband technology. Levy also played a critical role in the PhilipsElectronics acquisition of Veon, Inc. Prior to Veon Levy spent sixyears with Electronics for Imaging, Inc., holding several positionsalong the way including but not limited to; Program and QualityAssurance Manager, Sr. Technical Services Manager, Australia AccountManager, and European Technical Services Sr. Manager. During this timeLevy deployed and managed both EFI’s domestic and European TechnicalServices operations and oversaw all technical communications with OEM’stechnical services teams, ensuring that partner objectives wereachieved.</p><p>“His real world field experience with products, vendors and OEMsinstantly provides us with the intimate market knowledge and leadershipthis position requires,” said Codehost CEO, Sam Bizri. “He is theperfect fit to help us achieve our goals.”</p><p>Levy’s primary responsibilities will be to manage Codehost’s currentline of printing centric products and services, while executingCodehost’s goal of reducing the labor and complexity associated withcross-platform printing cohesiveness. Our core client side focus willcontinue to be on Unix and Linux, but the enterprise products will focuson multiple OS support and remote BrightQ™ administration.</p><p>“Along with our core technology focus, we are also very excited aboutestablishing industry partnerships in order to assist the printing OEMsin entering the growing Unix and emerging Linux printing market,” saidLevy. “Not to be too cliché, but we are working to make printing muchBrighter than it currently is.”</p>",
            "url": "https://www.codehost.com/news/2002/05/codehost-announces-printing-systems-gm.html",
            
            
            
            
            
            "date_published": "2002-05-31T00:00:00-07:00",
            "date_modified": "2002-05-31T00:00:00-07:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2002/04/codehost-releases-brightq-v1.0.html",
            "title": "Codehost Releases BrightQ v1.0",
            
            "content_text": "Los Angeles-based software developers, Codehost Inc. is debuting their BrightQ™ printing solution today at the On Demand Conference and Expo in New York City. BrightQ™ is a software package that provides a user-friendly interface and adds increased functionality to printing in the Unix and Linux environments.BrightQ™ received rave reviews at Beta sites in the retail, entertainment and technology industries. “Our product is scalable for nearly every market that uses Unix-based OSs. You will see this product everywhere from financial to government to engineering sectors,” said Codehost Sales Manager, Carlo Escario.Codehost is confident that BrightQ™ will soon become the dominant printing solution for Unix and Linux printing. “We are in the final stages of closing deals with many of the leading MFD manufacturers. The cost savings and the functionality of this product have a lot of people excited,” Escario said.As OEMs pass this product onto their clients they will save time and money through this solution’s low cost and simple administration. With Codehost’s BrightInstall™, even the most Unix/Linux-phobic systems support personnel can easily install, configure, and support their Unix/Linux customer base.Codehost’s BrightQ™ technology allows a seamless convergence to exist between the many varied flavors of Unix, Linux distributions, and traditional Wintel and Apple technologies when it comes to printed output. No longer is the Unix host left out of the sophisticated printing Queue.BrightQ™ opens a rapidly growing market segment for the digital printing OEM. Finally no more scrambling when the customer mentions the word Unix. Additionally, access to advanced finishing features no longer need to be accompanied by lp scripts that are both difficult to develop and maintain. Upgrading to the latest PostScript/PCL/PJL print drivers is seamless and turnkey with Codehost’s BrightQ™ allows the digital printing OEM to keep their Unix/Linux customers on an equal par with their traditional Wintel/Macintosh clients.With BrightQ™ technology the OEM gets, not only a turnkey printer driver interface, but can also capitalize on the Common Unix Printing System, industry standard printing protocols, and a print queue management system that is both simple and intuitive.“At Codehost we are working to converge Unix and Linux printing via a unified BrightQ interface. We are capitalizing upon what is already industry standard technology in order to ensure compatibility, while at the same time staying focused on development that yields a cohesive turnkey package,” said Eric Levy, Codehost’s General Manager of Printing Systems.",
            "content_html": "<p>Los Angeles-based software developers, Codehost Inc. is debuting their BrightQ™ printing solution today at the On Demand Conference and Expo in New York City. BrightQ™ is a software package that provides a user-friendly interface and adds increased functionality to printing in the Unix and Linux environments.</p><p>BrightQ™ received rave reviews at Beta sites in the retail, entertainment and technology industries. “Our product is scalable for nearly every market that uses Unix-based OSs. You will see this product everywhere from financial to government to engineering sectors,” said Codehost Sales Manager, Carlo Escario.</p><p>Codehost is confident that BrightQ™ will soon become the dominant printing solution for Unix and Linux printing. “We are in the final stages of closing deals with many of the leading MFD manufacturers. The cost savings and the functionality of this product have a lot of people excited,” Escario said.</p><p>As OEMs pass this product onto their clients they will save time and money through this solution’s low cost and simple administration. With Codehost’s BrightInstall™, even the most Unix/Linux-phobic systems support personnel can easily install, configure, and support their Unix/Linux customer base.</p><p>Codehost’s BrightQ™ technology allows a seamless convergence to exist between the many varied flavors of Unix, Linux distributions, and traditional Wintel and Apple technologies when it comes to printed output. No longer is the Unix host left out of the sophisticated printing Queue.</p><p>BrightQ™ opens a rapidly growing market segment for the digital printing OEM. Finally no more scrambling when the customer mentions the word Unix. Additionally, access to advanced finishing features no longer need to be accompanied by lp scripts that are both difficult to develop and maintain. Upgrading to the latest PostScript/PCL/PJL print drivers is seamless and turnkey with Codehost’s BrightQ™ allows the digital printing OEM to keep their Unix/Linux customers on an equal par with their traditional Wintel/Macintosh clients.</p><p>With BrightQ™ technology the OEM gets, not only a turnkey printer driver interface, but can also capitalize on the Common Unix Printing System, industry standard printing protocols, and a print queue management system that is both simple and intuitive.</p><p>“At Codehost we are working to converge Unix and Linux printing via a unified BrightQ interface. We are capitalizing upon what is already industry standard technology in order to ensure compatibility, while at the same time staying focused on development that yields a cohesive turnkey package,” said Eric Levy, Codehost’s General Manager of Printing Systems.</p>",
            "url": "https://www.codehost.com/news/2002/04/codehost-releases-brightq-v1.0.html",
            
            
            
            
            
            "date_published": "2002-04-24T00:00:00-07:00",
            "date_modified": "2002-04-24T00:00:00-07:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2002/01/codehost-offers-am-tech-mobile-printing.html",
            "title": "Codehost Offers AM Tech Mobile Printing",
            
            "content_text": "Codehost to develop Linux and Palm OS PDA drivers for AM Tech PrintersSoftware solutions provider Codehost Inc. and transaction printer manufacturer AM Tech Co., Ltd have established a strategic relationship where Codehost will develop drivers and applications for AM Tech’s lines of mobile thermal printers. AM Tech’s infrared printers will be available for PDA-POS terminals running Palm OS and the Linux operating system.Under the terms of the agreement Codehost will also extend their development and support services to AM Tech’s U.S. and international clients.“We feel that due to our extensive developer and support base we are in a good position to deliver high quality services to companies like AM Tech and their customers,” said Codehost Systems Engineer Rafael Barrero. “Providing full lifecycle support to our clients includes helping them meet the unique needs of their customers.”The first phase of this agreement will be to develop drivers for AM Tech’s Mobile Mate printers to function with Symbol Technologies PDAs running the Palm OS. This advancement will enable the Mobile Mate printer line to print from bar code, receipt, e-mail, spreadsheet and numerous other applications required by AM Tech’s printer users.AM Tech printers will be exhibited using Codehost software at the 2002 Consumer Electronics Show (Jan. 8-11) and Symbol’s 2002 Worldwide conference Jan. 7-13). Both events will be held in Las Vegas.",
            "content_html": "<h2 id=\"codehost-to-develop-linux-and-palm-os-pda-drivers-for-am-tech-printers\">Codehost to develop Linux and Palm OS PDA drivers for AM Tech Printers</h2><p>Software solutions provider Codehost Inc. and transaction printer manufacturer AM Tech Co., Ltd have established a strategic relationship where Codehost will develop drivers and applications for AM Tech’s lines of mobile thermal printers. AM Tech’s infrared printers will be available for PDA-POS terminals running Palm OS and the Linux operating system.</p><p>Under the terms of the agreement Codehost will also extend their development and support services to AM Tech’s U.S. and international clients.</p><p>“We feel that due to our extensive developer and support base we are in a good position to deliver high quality services to companies like AM Tech and their customers,” said Codehost Systems Engineer Rafael Barrero. “Providing full lifecycle support to our clients includes helping them meet the unique needs of their customers.”</p><p>The first phase of this agreement will be to develop drivers for AM Tech’s Mobile Mate printers to function with Symbol Technologies PDAs running the Palm OS. This advancement will enable the Mobile Mate printer line to print from bar code, receipt, e-mail, spreadsheet and numerous other applications required by AM Tech’s printer users.</p><p>AM Tech printers will be exhibited using Codehost software at the 2002 Consumer Electronics Show (Jan. 8-11) and Symbol’s 2002 Worldwide conference Jan. 7-13). Both events will be held in Las Vegas.</p>",
            "url": "https://www.codehost.com/news/2002/01/codehost-offers-am-tech-mobile-printing.html",
            
            
            
            
            
            "date_published": "2002-01-09T00:00:00-08:00",
            "date_modified": "2002-01-09T00:00:00-08:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2002/01/genicom-offers-clients-linux-products.html",
            "title": "Genicom Offers Clients Linux Products",
            
            "content_text": "Genicom printer drivers and apps now available for clients running Unix and Linux through the Codehost Print PackageGenicom has reached an agreement with Los Angeles-based Codehost Inc. to offer Linux applications and drivers for all laser, line matrix and serial printer lines. Compatibility with the Unix and Linux operating systems is now available through Codehost’s Printer Packages.These packages include drivers, print job managers, configuration tools, and installers and other scalable applications, making Genicom printers user friendly for the rapidly growing Linux market and the established Unix users. The Codehost Printer Package provides an easy-to-use Windows-like environment that until now was not available for Linux or Unix.According to Forrester Group, the global Linux market currently represents $15 billion and by 2004, Linux is expected to be a $75 billion industry.Current and future Genicom clients running Linux will purchase the license and support from Codehost. Additionally, Codehost will provide customization of this package and other Linux development services for clients based on their unique needs.",
            "content_html": "<h2 id=\"genicom-printer-drivers-and-apps-now-available-for-clients-running-unix-and-linux-through-the-codehost-print-package\">Genicom printer drivers and apps now available for clients running Unix and Linux through the Codehost Print Package</h2><p>Genicom has reached an agreement with Los Angeles-based Codehost Inc. to offer Linux applications and drivers for all laser, line matrix and serial printer lines. Compatibility with the Unix and Linux operating systems is now available through Codehost’s Printer Packages.</p><p>These packages include drivers, print job managers, configuration tools, and installers and other scalable applications, making Genicom printers user friendly for the rapidly growing Linux market and the established Unix users. The Codehost Printer Package provides an easy-to-use Windows-like environment that until now was not available for Linux or Unix.</p><p>According to Forrester Group, the global Linux market currently represents $15 billion and by 2004, Linux is expected to be a $75 billion industry.</p><p>Current and future Genicom clients running Linux will purchase the license and support from Codehost. Additionally, Codehost will provide customization of this package and other Linux development services for clients based on their unique needs.</p>",
            "url": "https://www.codehost.com/news/2002/01/genicom-offers-clients-linux-products.html",
            
            
            
            
            
            "date_published": "2002-01-08T00:00:00-08:00",
            "date_modified": "2002-01-08T00:00:00-08:00",
            "author": {
                "name": "Codehost, Inc."
            }
        },
    
        {
            "id": "https://www.codehost.com/news/2001/11/samsung-enters-linux-printing-market.html",
            "title": "Samsung Enters Linux Printing Market",
            
            "content_text": "SAMSUNG ELECTRONICS PARTNERS WITH CODEHOST INC. TO ADD LINUX SUPPORT FOR PRINTER LINESSamsung Electronics has entered into a partnership with Los Angeles based Codehost, Inc. to develop applications and drivers for their printers for the Linux operating system. Printers supported include the ML-1210, which Samsung has recently begun shipping. Codehost will be demonstrating the Samsung ML-1210 on Linux at their booth in the Linux Business Expo at Comdex from November 12-16.The package Codehost is implementing supports GDI, PCL and Postscript printing systems and includes custom applications to install, configure and manage the printers.The timing is right for initiatives such as this. According to top industry research firms (IDC and Forrester), the 20 million-plus Linux user market is exploding. Linux sales are expected to double in 2002. Hardware companies are developing Linux drivers for their peripherals and devices. At the same time, software companies are in the process of porting their applications to take advantage of this growing commercial market.“Linux offers an unprecedented opportunity for companies to expand the market for their existing products”, says Codehost CEO, Sam Bizri. “On one hand they don’t need to invest in the development of new products and product launches; and on the other hand they’re entering into a space where there is a growing demand from customers and a very low number of competitors.”",
            "content_html": "<h2 id=\"samsung-electronics-partners-with-codehost-inc-to-add-linux-support-for-printer-lines\">SAMSUNG ELECTRONICS PARTNERS WITH CODEHOST INC. TO ADD LINUX SUPPORT FOR PRINTER LINES</h2><p>Samsung Electronics has entered into a partnership with Los Angeles based Codehost, Inc. to develop applications and drivers for their printers for the Linux operating system. Printers supported include the ML-1210, which Samsung has recently begun shipping. Codehost will be demonstrating the Samsung ML-1210 on Linux at their booth in the Linux Business Expo at Comdex from November 12-16.</p><p>The package Codehost is implementing supports GDI, PCL and Postscript printing systems and includes custom applications to install, configure and manage the printers.</p><p>The timing is right for initiatives such as this. According to top industry research firms (IDC and Forrester), the 20 million-plus Linux user market is exploding. Linux sales are expected to double in 2002. Hardware companies are developing Linux drivers for their peripherals and devices. At the same time, software companies are in the process of porting their applications to take advantage of this growing commercial market.</p><p>“Linux offers an unprecedented opportunity for companies to expand the market for their existing products”, says Codehost CEO, Sam Bizri. “On one hand they don’t need to invest in the development of new products and product launches; and on the other hand they’re entering into a space where there is a growing demand from customers and a very low number of competitors.”</p>",
            "url": "https://www.codehost.com/news/2001/11/samsung-enters-linux-printing-market.html",
            
            
            
            
            
            "date_published": "2001-11-13T00:00:00-08:00",
            "date_modified": "2001-11-13T00:00:00-08:00",
            "author": {
                "name": "Codehost, Inc."
            }
        }
    
    ]
}
